<?php
/*******************************************************************************
 * Copyright (c) 2017.
 * this file created in printing-office project
 * framework: Yii2
 * license: GPL V3 2017 - 2025
 * Author:amintado@gmail.com
 * Company:shahrmap.ir
 * Official GitHub Page: https://github.com/amintado/printing-office
 * All rights reserved.
 ******************************************************************************/

use backend\assets\BackendHelpAsset;
use yii\web\View;

/**
 * @var $this View
 * @var string $asset_dir
 */
$asset= BackendHelpAsset::register($this);
$asset_dir=$asset->baseUrl.'/assets';

?>

<style>

    .content-wrapper, .right-side {

        background-color: hsl(0, 0%, 100%) !important;

    }
</style>
<menu-aside>
    <header>
        <span>اسلاید ساز چند لایه</span>
        <small>v6.5.8 - Aug 28, 2017</small>
    </header>
    <nav>
        <ul id="sidebar">
            <li data-hash="introduction" class="active">
                <span>معرفی</span>
                <small>معرفی،ویژگی ها، تشکرها</small>
            </li>

            <li data-hash="getting-started">
                <span>مقدمات شروع</span>
                <small>مرکز پیش نمایش ها و تنظیمات</small>
            </li>
            <li data-hash="slider-builder">
                <span>ساخت اسلاید ها</span>
                <small>همه ی دانستنی ها در مورد اسلایدر</small>
            </li>
            <!--<li data-hash="publishing-sliders">-->
            <!--<span>منتشر کردن اسلاید</span>-->
            <!--<small>کدهای کوتاه, ابزارک ها, PHP</small>-->
            <!--</li>-->
            <!--<li data-hash="publishing-popups">-->
            <!--<span>ساخت باز شو ها</span>-->
            <!--<small>راه انداز ها, صفحات هدف &amp; Audience</small>-->
            <!--</li>-->
            <li data-hash="integration-guides">
                <span>راهنماهای شخص ثالث</span>
                <small>استفاده از لایت باکس ها و دیگر اسلاید ها</small>
            </li>
            <!--<li data-hash="advanced-customization">-->
            <!--<span>شخصی سازی های پیشرفته</span>-->
            <!--<small>انتقال دهنده های سفارشی و ابزارهای برنامه نویسی</small>-->
            <!--</li>-->
            <!--<li data-hash="troubleshooting">-->
            <!--<span>عیب یابی</span>-->
            <!--<small>حل مشکلات پیش آمده</small>-->
            <!--</li>-->
            <li data-hash="developer-documentation">
                <span>اسناد برنامه نویسی</span>
                <small>برای طراحی قالب</small>
            </li>

        </ul>
    </nav>
</menu-aside>

<div id="content">
    <div>

        <!--  Introduction -->
        <section data-target="introduction" class="active">

            <nav>
                <ul>
                    <li><a href="#overview">معرفی</a></li>
                    <li><a href="#about-item">درباره ی این آیتم</a></li>
                    <li><a href="#third-party">اعتبارات شخص ثالث</a></li>
                </ul>
            </nav>


            <!-- Introduction: Overview -->
            <article class="active">
                <h1 data-target="overview">معرفی</h1>
                <p>با تشکر از اینکه از این سیستم استفاده می کنید، لطفا چنانچه به موردی برخوردید، با ما تماس بگیرید.</p>

                <h2 data-target="about-item">درباره ی این آیتم</h2>
                <p>این یک اسلاید ساز بسیار حرفه ای برای ساخت انواع اسلایدهای چند رسانه ای برای صفحات مختلف سایت است، که
                    حتی میتوان از ویدیو، کد های HTML و صوت، متن و ... در آن استفاده نمود.</p>

                <p>بیش از 200 نمونه انیمیشن دو بعدی و سه بعدی در این اسلاید ساز فراهم گردیده است.انواع امکانات ویرایشی
                    اعم از ویرایش عکس و متن و ...</p>

                <p>
                    این اسلاید ساز با انواع دستگاه ها اعم از موبایل، تبلت، رایانه های دسکتاپ، رایانه های مک بوک رتینا و
                    ... همخوانی دارد.
                    با این اسلاید ساز میتوانید، اسلایدهایی با لایه های مختلف بسازید،شما میتوانید هر نوه محتوایی را در یک
                    اسلاید بگنجانید.
                    تکنولوژی lazy load و بارگذاری اسکریپت باعث بهینه شدن اسلایدها در این اسلاید ساز حرفه ای شده است.
                    همچنین این اسلاید ساز با سیستم CEO نیز هماهنگ است و میتوانید هر بحشی از آن را که نیاز دارید، به
                    موتور های جست و جو معرفی کنید، تا در نتایج جست و جو دیده شود.
                    قابلیت CEO یکی از ویژگی های بارز این سیستم اسلاید ساز است و در سیستم های مشابه یافت نمیشود.
                </p>

                <p>
                    این سیستم اسلایدر با 18 قالب از پیش آماده شده در اختیار شما قرار گرفته است.
                    همچنین امکانات کاملی برای سفارشی سازی در اختیار شما قرار گرفته است.
                </p>

                <p>لیست امکانات کامل را میتوانید در <a href="https://layerslider.kreaturamedia.com/" target="_blank">صفحه
                        ی اصلی سایت اسلایدرساز تماشا کنید</a>.</p>
            </article>

            <!--  Introduction: Third party -->
            <article>

                <h2 data-target="third-party">اعتبارات شخص ثالث</h2>
                <p>
                    من از دوستانی که در ساخت این بخش از پروژه کمک کرده اند، صمیمانه تشکر می کنم.
                    این حق انهاست که نام آنها را در این سند آورده و کاری که انجام شده را به معرض نمایش بگذارم.
                </p>
                <div class="table">
                    <table>
                        <thead>
                        <tr>
                            <th>Project</th>
                            <th>Homepage</th>
                            <th>Motto</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>Adobe Creative SDK</td>
                            <td><a href="https://creativesdk.adobe.com/" target="_blank">creativesdk.adobe.com</a></td>
                            <td>یک سیستم فتوشاپ کوچک، که امکان ویرایش حرفه ای تصاویر را میدهد.</td>
                        </tr>
                        <tr>
                            <td>Air Datepicker</td>
                            <td><a href="http://t1m0n.name/air-datepicker/docs/" target="_blank">t1m0n.name</a></td>
                            <td>یک انتخاب کننده ی تاریخ میلادی که در بخش برنامه ریزی پخش اسلاید از آن استفاده شده است
                            </td>
                        </tr>
                        <tr>
                            <td>CodeMirror</td>
                            <td><a href="http://codemirror.net/" target="_blank">codemirror.net</a></td>
                            <td>ویرایشگر های کد که در پروژه برای مدیریت کدهای HTML,JS,CSS,LESS توسط کاربر استفاده شده
                                است.
                            </td>
                        </tr>
                        <tr>
                            <td>Dashicons</td>
                            <td><a href="https://github.com/melchoyce/dashicons/" target="_blank">github.com</a></td>
                            <td>آیکون های رسمی وردپرس که در اکثر آپشن ها و گزینه ها استفاده شده اند.</td>
                        </tr>
                        <tr>
                            <td>Google Fonts API</td>
                            <td><a href="https://www.google.com/fonts" target="_blank">google.com</a></td>
                            <td>ده ها فونت که توسط شرکت بزرگ گوگل برای استفاده در وب گردآوری شده است.</td>
                        </tr>
                        <tr>
                            <td>GreenSock</td>
                            <td><a href="http://www.greensock.com/" target="_blank">greensock.com</a></td>
                            <td>یک پلتفرم فوق کاربردی برای متحرک سازی در فضای وب</td>
                        </tr>
                        <tr>
                            <td>jQuery</td>
                            <td><a href="http://jquery.com/" target="_blank">jquery.com</a></td>
                            <td>افزونه ای برای نوشتن کدهای کمتر و در عین حال، برنامه های کاربردی تر</td>
                        </tr>
                        <tr>
                            <td>MiniColors</td>
                            <td><a href="http://labs.abeautifulsite.net/jquery-minicolors/" target="_blank">labs.abeautifulsite.net</a>
                            </td>
                            <td>یک باکس انتخاب رنگ جمع و جور بر پایه ی jQuery</td>
                        </tr>
                        <tr>
                            <td>phpQuery</td>
                            <td><a href="https://code.google.com/p/phpquery/" target="_blank">code.google.com</a></td>
                            <td>phpQuery is a server-side, chainable, CSS3 selector driven Document Object Model (DOM)
                                API based on jQuery JavaScript Library.
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>
            </article>
        </section>


        <!-- Getting Started -->
        <section data-target="getting-started">

            <div class="navwrap">
                <nav>
                    <ul>
                        <li><a href="#managing-sliders">مدیریت اسلاید ها</a></li>
                        <li>
                            <a href="#demo-sliders">وارد کردن قالب های آماده اسلاید</a>

                        </li>
                        <li>
                            <a href="#import-export">واردات و استخراج اسلایدها</a>
                            <ul>
                                <li><a href="#import-sliders">وارد کردن اسلایدها</a></li>
                                <li><a href="#export-sliders">خروجی گرفتن از اسلایدها</a></li>
                                <li class="troubleshooting">
                                    <a href="#import-troubleshooting">عیب یابی</a>
                                </li>
                            </ul>
                        </li>
                        <li><a href="#google-fonts">استفاده از فونت های گوگل</a></li>

                        <li><a href="#advanced-options">تنظیمات پیشرفته</a></li>
                    </ul>
                </nav>
            </div>

            <!-- Getting Started: Managing sliders -->
            <article>
                <h1 data-target="managing-sliders">مدیریت اسلایدها</h1>
                <div class="table">
                    <table>
                        <thead>
                        <tr>
                            <th>عملیات</th>
                            <th>توضیحات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>افزودن اسلاید جدید</td>
                            <td>کلید <code><span class="dashicons dashicons-plus"></span> اضافه کردن اسلاید جدید</code>
                                را فشار دهید.از شما یک نام درخواست می شود.اسمی برای اسلایدر جدید وارد کنید و شروع به
                                ساخت اسلاید کنید.
                                توجه داشته باشید که اسامی اسلایدها یونیک بوده و نمیتواند تکراری باشد.
                            </td>
                        </tr>
                        <tr>
                            <td>تکثیر اسلایدر ها</td>
                            <td>
                                نشانگر ماوس را روی اسلایدر مورد نظر قرار دهید و روی <span
                                        class="dashicons dashicons-arrow-down-alt2"></span> کلیک کنید، سپس از اکشن های
                                نمایش داده شده، <code><span class="dashicons dashicons-admin-page"></span> ساخت کپی از
                                    این</code>
                                را انتخاب کنید.سپس یک کپی از اسلایدی که انتخاب کرده اید، دقیقا با همان خصوصیات ساخته
                                میشود.
                                این خصوصیت زمانی که شما میخواهید اسلایدری را دستکاری کنید، ولی نمیخواهید به اصل آن صدمه
                                ای وارد شود بدرد میخورد.
                            </td>
                        </tr>
                        <tr>
                            <td>پاک کردن یک اسلایدر</td>
                            <td>نشانگر ماوس را روی اسلایدر مورد نظر قرار دهید و <span
                                        class="dashicons dashicons-arrow-down-alt2"></span> را فشار دهید، سپس از اکشن
                                های نمایش داده شده <code><i class="dashicons dashicons-trash"></i> حذف</code> را انتخاب
                                کنید.این یک حذف سمبلیک است و در واقع این اسلاید از همه ی صفحات شما حذف میشود، اما یک کپی
                                از آن در بانک داده به عنوان پشتیبان باقی میماند.
                            </td>
                        </tr>
                        <tr>
                            <td>بازگردانی اسلایدها</td>
                            <td>شما میتوانید اسلایدهای پاک شده را با استفاده از فیلتر، بر روی صفحه لیست کنید.فقط کافیست
                                بر روی آیکون (<i class="dashicons dashicons-backup"></i>) در بالای صفحه کلیک کنید.
                            </td>
                        </tr>
                        <tr>
                            <td>حذف دائمی اسلایدر</td>
                            <td>
                                کسی از داشتن یک نسخه ی پشتیبان از داده بدش نمی آید، این روی کارایی سایت شما تاثیری
                                ندارد.
                                بنابراین توصیه نمیکنم، اسلایدی را از سیستم حذف کنید، اما چنانچه نیاز بود این کار را
                                انجام دهید، اسلاید مد نظر خود را از لیست انتخاب کنید، و
                                <code>حذف</code> را از آپشن های اسلاید انتخاب کنید، تا برای همیشه حذف شود.
                            </td>
                        </tr>
                        <tr>
                            <td>ترکیب اسلایدرها</td>
                            <td>
                                اگر شما به صفحاتی از یک اسلاید نیاز دارید که درون اسلاید دیگری تنظیم شده است، میتوانید
                                آنهارا ترکیب کنید.
                                فقط کافیست اسلایدها را تیک بزنید و از لیست اقدامات گروهی در پایین سمت چپ لیست اسلایدها
                                گزینه ی
                                <code>ادغام انتخاب شده ها در اسلاید جدید</code> را انتخاب کنید،سپس کلید انجام دادن را
                                بزنید،

                                حالا یک اسلاید جدید با نام merged sliders دارید.
                            </td>
                        </tr>

                        </tbody>
                    </table>
                </div>
            </article>

            <!-- Getting Started: Importing demo content -->
            <article>
                <h1 data-target="demo-sliders">وارد کردن قالب های آماده اسلاید</h1>
                <p>کلید <code><i class="dashicons dashicons-star-filled"></i>فروشگاه الگوهای آماده</code> را(در صورت
                    وجود) در لیست اسلایدها انتخاب کنید تا وارد صفحه ی فروشگاه اسلاید ساز شوید و قالب های آماده را
                    ببینید.
                </p>
                <p>
                    وارد کردن قالب ها این امکان را میدهد که بتوانید از تنظیمات آنها برای ساخت اسلایدهای زیباتر استفاده
                    کنید.
                    همچنین میتوانید تکنیک های بکار رفته در آنها را واکاوی نموده و فراگیری کنید.
                    شما میتوانید در فروشگاه قالب های آماده،هر دو مورد، قالب های حرفه ای و قالب های ساده را پیدا کنید.
                    این قالب ها دسته بندی شده هستند، اما قالب های حرفه ای نیاز به خریده شدن دارند، که متاسفانه امکان
                    خرید آنها فعلا در ایران میسر نیست، شاید در آینده ای نزدیک، این فروشگاه قالب با فروشگاه قالب شخصی
                    مدیر پروژه اذغام شود.

                </p>


                <figure>
                    <div class="img-holder" style="padding-bottom: 26.0341%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-slider-templates2x.jpg"
                             width="2466" height="642">
                    </div>
                    <figcaption class="zigzag">یک تصویر از نمای کلید فروشگاه</figcaption>
                </figure>


            </article>

            <!-- Getting Started: Import / Export sliders -->
            <article>
                <h1 data-target="import-export">واردات و استخراج اسلایدها</h1>
                <h2 data-target="import-sliders">وارد کردن اسلایدها</h2>
                <p>بالای لیست اسلایدها گزینه ی <code><i class="dashicons dashicons-upload"></i>وارد کردن اسلایدر</code>
                    را فشار دهید.
                    این یک پنجره ی بازشو را به شما نشان خواهد داد که میتوانید محل فایل پشتیبان اسلاید خود را در آن
                    انتخاب کنید.
                    پسوند فایل باید .json یا .zip باشد.
                    پس از انتخاب فایل کلید
                    <code>وارد کردن اسلاید</code> را فشار دهید، اما قبل از اینکار لطفا یکبار راهنمایی های درون ان پنجره
                    را مطالعه کنید.</p>
                <figure>
                    <div class="img-holder" style="padding-bottom: 26.0341%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-upload-sliders2x.jpg"
                             width="2466" height="642">
                    </div>
                    <figcaption class="zigzag">یک تصویر از کلیک وارد کردن اسلاید ها</figcaption>
                </figure>


                <h2 data-target="export-sliders">خروجی گرفتن از اسلایدها</h2>
                <p>نشانگر ماوس را روی اسلاید مورد نظرتان در لیست اسلایدها ببرید و روی <i
                            class="dashicons dashicons dashicons-arrow-down-alt2"></i>کلیک کنید.حالا از بین گزینه های
                    نمایش داده شده <code><i class="dashicons dashicons dashicons-share-alt2"></i> خروجی گرفتن</code> را
                    انتخاب کنید تا یک فایل .zip در اختیار شما قرار دهد، شما میتوانید به عنوان فایل پشتیبان از آن استفاده
                    کنید، یا آن را در سایت های دیگر که از این اسلایدر استفاده میکنند،آپلود کنید.</p>

                <p>شما همچنین میتوانید به صورت گروهی از اسلایدها خروجی بگیرید.بدنیصورت که ابتدا انها را تیک میزنید و سپس
                    بر روی یکی از آنها
                    <mark>خروجی گرفتن</mark>
                    را انتخاب می کنید.
                </p>
                <figure>
                    <div class="img-holder" style="padding-bottom: 26.0341%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-export-sliders2x.jpg"
                             width="2466" height="642">
                    </div>
                    <figcaption class="zigzag">یک تصویر از روش استخراج فایل پشتیبان</figcaption>
                </figure>


                <h2 data-target="import-troubleshooting">عیب یابی</h2>
                <ul>

                    <li>
                        وارد کردن فایل های تصویری با حجم بالا ممکن است در اسلایدر میسر نباشد،اگر در این مورد به خطایی
                        برخورد نمودید،

                        با پشتیبان سایت به شماره 03953466620 تماس حاصل نمایید، تا راهنمایی لازم را انجام دهد.
                        این بدلیل ایجاد محدودیت در سطح آپلود فایل هاست که توسط مدیر وبسایت در نظر گرفته شده است.
                    </li>
                    <li>
                        اسلایدهای بزرگتر با تعداد تصویر بالا، زمانی که در حال واردات به سیستم از طرق فایل پشتیبان
                        هستند،ممکن است منابع بیشتری از سسیستم را درگیر کنند و در برخی موارد خطای Low Memory بدهند.
                        در این صورت، وارد کردن این فایل ها را به عهده ی پشتیبان فایل بگذارید، تا آنها را از طریق خود
                        سرور بارگذاری کند.

                    </li>
                    <li>زمان اجرای فرامین بر روی سرور یک محدودیت ایجاد می کند.فایل های اسلاید حجیم، ممکن است برای وارد
                        کردن مجدد به سایت به زمان اجرای بیشتری نیاز داشته باشند
                        که با توجه به محدودیت زمان اجرای سرور، ممکن است با خطای Execute Time Limit مواجه شوید.
                        در اینصورت مراتب را با مدیر سایت در میان بگذارید تا راه حل مناسب را در این زمینه در اختیار شما
                        قرار دهد.
                    </li>
                </ul>
            </article>

            <!-- Getting Started: Using Google Fonts -->
            <article>
                <h1 data-target="google-fonts">استفاده از فونت های گوگل</h1>
                <p>این سیستم اسلایدساز میتواند از فونت های سفارشی منتشر شده توسط گوگل استفاده کند <a
                            href="https://fonts.google.com/" target="_blank">fonts.google.com</a>.
                    فونت هایی که اینجا تنظیم می کنید، در بخش ویرایشگر های متنی اسلایدساز در دسترس خواهند بود و میتوانید
                    به راحتی از آنها استفاده کنید و آنها را روی متن خود اعمال کنید.
                </p>
                <figure>
                    <div class="img-holder" style="padding-bottom: 23.7477%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-google-fonts2x.png"
                             width="2156" height="512">
                    </div>
                    <figcaption>تصویری از قسمت تنظیم فونت های گوگل در سیستم اسلایدساز</figcaption>
                </figure>


            </article>

            <!-- Getting Started: Permission settings -->


            <!-- Getting Started: Advanced settings -->
            <article>
                <h1 data-target="advanced-options">درباره ی بخش پیشرفته</h1>
                <p>در سر برگ پیشرفته در صفحه ی لیست اسلایدها شما تعدادی گزینه ی عیب یابی برای استفاده پیدا می کنید.
                </p>

                <div class="km-notification info cf">
                    <span class="dashicons dashicons-info"></span>
                    لطفا به یاد داشته باشید، این تنظیمات در سورتی که درست تنظیم نشود میتواند سایت شما را از کار بیندازد.
                    به طور پیشفرض تغییر دادن آن را پیشنهاد نمیکنم.
                    این تنظیمات ممکن است در حالات خاصی مشکلات بوجود آمده حین استفاده ی شما را حل کند، اما فقط زمانی که
                    واقعا نیاز بود، و با اگاهی کامل آنها را تغییر دهید.
                </div>

                <figure>
                    <div class="img-holder" style="padding-bottom: 31.9109%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-advanced-settings2x.png"
                             width="2156" height="688">
                    </div>
                    <figcaption>تصویری از بخش تنظیمات پیشرفته</figcaption>
                </figure>
            </article>

            <!-- Gettings Started: System Status -->

        </section>


        <!-- Using the Slider Builder -->
        <section data-target="slider-builder">

            <nav>
                <ul>
                    <li><a href="#builder-overview">شروع کار</a></li>
                    <li>
                        <a href="#builder-slider-settings">تنظیمات اسلاید</a>
                        <ul>
                            <li><a href="#builder-slide-defaults">پیش فرض های اسلاید</a></li>
                            <li><a href="#builder-advanced-settings">تنظیمات پیشرفته</a></li>
                        </ul>
                    </li>
                    <li>
                        <a href="#builder-slide-options">افزودن اسلاید</a>
                        <ul>
                            <li><a href="#builder-slide-manage">مدیریت اسلایدها</a></li>
                            <li><a href="#builder-slide-transitions">انیمیشن های اسلایدها</a></li>
                            <li><a href="#builder-slide-linking">لینک دهی اسلایدها</a></li>
                        </ul>
                    </li>
                    <li><a href="#builder-preview-features">امکانات پیش نمایش</a></li>
                    <li>
                        <a href="#layer-options">افزودن لایه ها</a>
                        <ul>
                            <li><a href="#builder-manage-layers">مدیریت لایه ها</a></li>
                            <li><a href="#builder-layer-types">انواع لایه ها</a></li>
                            <li><a href="#builder-layer-devices">دستگاه های پشتیبانی شده</a></li>
                            <li><a href="#builder-layer-media">صوت و تصویر</a></li>
                            <li><a href="#builder-layer-shortcode">کدهای کوتاه و محتوای هوشمند</a></li>
                            <li><a href="#builder-layer-transitions">انیمیشن لایه ها</a></li>
                            <li><a href="#builder-layer-linking">لینک دهی لایه ها</a></li>
                            <li><a href="#builder-layer-attributes">ویژگی های لایه</a></li>
                            <li><a href="#builder-layer-styles">سبک های لایه</a></li>
                        </ul>
                    </li>
                    <li><a href="#builder-image-editor">ویرایش تصویر</a></li>
                    <li><a href="#builder-popout">ویرایشگر در پنجره ی جدا</a></li>
                    <li><a href="#builder-timeline">خط زمان هوشمند</a></li>

                    <li><a href="#builder-shortcuts">کلیدهای صفحه کلید</a></li>
                </ul>
            </nav>

            <!-- Using the Slider Builder: Overview -->
            <article>
                <h1 data-target="builder-overview">بیاید کار با اسلایدساز رو شروع کنیم</h1>
                <p>
                    از آنجا که این اسلایدساز میتواند محتوای حرفه ای را برای شما تولید کند،
                    اما رابط کاربری شلوغ آن در نکاه اول ممکن است کمی ترسناک و دور از یادگیری به نظر برسد.
                    تنظیمات جزئی زیادی برای هر بخش از اسلاید وجود دارد، پس مهم است که هم ما برای تولید این محتوای آموزشی
                    وقت بگذاریم،
                    هم شما برای فراگیری آن زمان صرف کنید.
                    در ابتدا نگاهی به این موارد بیندازید:
                </p>
                <ul>
                    <li>
                        <mark>خواندن تولتیپ ها:</mark>
                        تفریبا هر جایی از پنل مدیریتی اسلاید،اطلاعات راهنما با صورت تولتیپ قرار داده شده است.
                        کافیست نشانگر ماوس خود را بر روی گزینه ای که نمیدانید چیست نگهدارید،
                        تا بالای آن یک بالن سیاه رنگ حاوی توضیحات باز شود.
                    </li>
                    <li>
                        <mark>از حالت پیشنمایش استفاده کنید:</mark>
                        زمانی که شما سخت در حال تلاش برای ایجاد یک اسلاید شیک هستید،
                        ممکن است بخواهید دائما نتیجه ی کارتان را با آنچه انجام دادید مقایسه کنید،
                        بنابراین نیازی نیست تا حتما اسلاید را روی سایت منتشر کنید و انجا تغییرات را ببینید.
                        از پنجره ی پیش نمایش برای نمایش انیمیشن ها و آنجه انجام داده اید در فضای شبیه سازی شده ی واقعی
                        استفاده کنید.
                        در درون پنجره ی پیش نمایش میتوانید مثل یک ویرایشگر تصویر، لایه ها را جابجا کنید و دوباره نتیجه
                        را با کلید پیش نمایش ببینید.
                        دو کلید پیش نمایش به خاکستری رنگ در نوار بالای پنجره ی پیش نمایش وجود دارد:
                        کلید اسلاید
                        و کلید لایه
                        کلید اسلاید ، پیش نمایش کل اسلاید را به شما نشان میدهد.
                        اما کلید پیش نمایش لایه، فقط پیش نمایش لایه ای را که انتخاب نموده اید را به شما نمیش میدهد.
                    </li>
                    <li>
                        <mark>از قالب های آماده الهام بگیرید:</mark>
                        در بخش <a href="#demo-sliders">مقدمات شروع / وارد کردن قالب های آماده ی اسلاید</a>,
                        روش وارد کردن قالب های آماده از فروشگاه قالب ها را مرور کردیم.
                        شما با استفاده از فالب های آماده میتوانید یاد بگیرید که چطور گزینه ها تنشیم می شوند،
                        و این تنظیمات جه تاثیری بر روی اسلاید دارند،
                        تکنیک یادگیری از روی نمونه ی آماده در واقع یک نوع معندسی معکوس است که همه ی
                        ما کم و بیش با آن آشنا هستیم.
                        این تکنیک در استفاده از سیستم اسلایدساز خیلی به شما کمک خواهد کرد.
                        به طور پیش فرض تعدادی اسلاید برای شما از فروشگاه وارد کرده ایم که میتوانید در لیست اسلایدها آن
                        ها را ببینید.
                        هر وقت انها را دسکاری کردید و دیدید درست کار نمیکنند، کافیست آنها را پاک کنید، و مجددا از داخل
                        فروشگاه
                        آنها را وارد کنید.
                    </li>
                </ul>
            </article>

            <!-- Using the Slider Builder: Slider settings -->
            <article>
                <h1 data-target="builder-slider-settings">تنظیمات اسلاید</h1>
                <p>
                    این صفحه به شما این امکان را میدهد تا تنظیم کنید، بوم اسلاید به طور کلی چه رفتاری داشته باشد.
                    در اینجا تنظیماتی از قبیل تنظیم اندازه ی بوم اسلایدها،
                    روش نمایش در دستگاه های موبایل،
                    کلید هایی که باید روی اسلایدشو نمایش داده شوند،
                    قالب بوم اسلاید شو،
                    تنظیمات کلید های ناوبری به اسلاید قبل و بعد،
                    رفتار فیلم های روی اسلاید و ...
                    را خواهید داشت.
                    هر گزینه از این بخش دارای راهنمای جدا در همان بخش است.
                    برای دسترسی به راهنما کافیست نشانگر ماوس خود را روی هر گزینه نگه دارید،
                    تا راهنمای آن گزینه درست بالای همان گزینه باز شود.
                </p>
                <p>
                    ما از لیست کردن مجدد همه ی گزینه های این بخش در اینجا اجتناب می کنید، زیرا همانطور که ذکر شد، هر
                    گزینه راهنمای ویژه ی خود را دارد.
                    این سند فقط جهت آشنایی شما با موارد کلی سیستم و نکات خاص آن میباشد.
                </p>
                <figure>
                    <div class="img-holder" style="padding-bottom: 49.3519%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-slider-settings2x.png"
                             width="2160" height="1066">
                    </div>
                    <figcaption class="zigzag">تصویری از فضای تنظیمات اسلاید</figcaption>
                </figure>

            </article>

            <!-- Using the Slider Builder: Slide defaults -->
            <h2 data-target="builder-slide-defaults">پیش فرض های اسلاید</h2>
            <p>
                وقتی شما با اسلایدها و لایه ها کار می کنید، ممکن است توجه شما به این جلب شود که،
                بعضی گزینه ها روی حالت inherit و یا ارث بری هستند.
                این بدین معنیست که اگر تنظیمی روی آنها قرار ندهید، از تنظیمات انجام شده روی والد های خود استفاده می
                کنند.
                لایه ها معمولا از تنظیمات همان صفحه ی اسلاید استفاده می کنند،
                و اگر کاربر روی آن صفحه از اسلاید تنظیم خاصی انجام نداده باشد،
                تنظیمات از این بخش ارث بری خواهند شد.
                این به شما کمک زیادی می کند که از گزینه های ارث بری استفاده کنید.
                مثلا اگر قرار باشد برای هر صفحه از اسلاید خود، یک تصویر یا رنگ زمینه ی مخصوص انتخاب کنید،این یکم خسته
                کننده است.
                اما شما میتوانید در بخش تنظیمات اسلاید، یک تصویر برای زمینه ی همه ی اسلایدها تنظیم کنید.
                این روی همه ی صفحات یک اسلاید تنظیم میشود، مگر اینکه برای یک اسلاید خاص تصویر زمینه ی دیگری را انتخاب
                کنید.
                در اینصورت این بدین معنیست که صفحات دیگر که برای آنها تصویر زمینه را تنظیم نکرده اید،از تنظیمات کلی ارث
                بری می کنند، که واژه ی انگلیسی آن <code>inherit</code> است.
                مورد دیگری که برای کاربرد ارث بری میتوان به وضوع به آن اشاره کرد اندازه ی اسلاید است.
                شما نمیتوانید اندازه ی هر صفحه ی اسلاید را به طور جدا تنظیم کنید،پس بهتر است این اندازه از والد ارث بری
                شود.
                در این بخش چند تنظیم برای ارث بری در لایه ها و اسلایدها قرار داده شده است که هر کدام دارای مقدار پیش
                فرضی هستند،
                اما شما میتوانید مقادیر مد نظر خود را در اینجا وارد کنید.
            </p>
            <figure>
                <div class="img-holder" style="padding-bottom: 63.6111%;">
                    <img src="<?= $asset_dir.'/img' ?>/illustration-slide-defaults2x.png"
                         width="2160" height="1374">
                </div>
                <figcaption class="zigzag">یک تصویر از بخش پیض فرض های اسلاید</figcaption>
            </figure>


            <!-- Using the Slider Builder: Advanced Settings-->
            <h2 data-target="builder-advanced-settings">تنظیمات پیشرفته</h2>
            <p>
                بخش تنظیمات اسلایدر یک سری گزینه های مخفی دارد، که گاها توسط افراد حرفه ای ممکن است مورد استفاده قرار
                گیرد.
                ما آنها را از دید افراد عادی مخفی می کنید، که باعث سردرگمی نشود.
                اگر شما دوست دارید آن گزینه ها را فعال و تغییر دهید، کافیست از گزینه ی (نمایش تنظیمات پیشرفته) که بر روی
                سمت راست نوار بالای بخش تنظیمات اسلاید قرار دارد استفاده کنید.
                میتوانید تصویر آن را در زیر مشاهده کنید:
            </p>
            <figure>
                <div class="img-holder" style="padding-bottom: 49.3519%;">
                    <img src="<?= $asset_dir.'/img' ?>/illustration-slider-advanced-settings2x.png"
                         width="2160" height="1066">
                </div>
                <figcaption class="zigzag">Illustration of advanced slide options section</figcaption>
            </figure>

            <!-- Using the Slider Builder: Adding slides -->
            <article>

                <h1 data-target="builder-slide-options">افزودن اسلاید</h1>
                <p>
                    همانطور که قبل تر متوجه شدید،
                    ما همه ی گزینه ها را در اینجا لیست نمیکنیم،
                    زیرا در رابط کاربری مدیریت اسلاید،
                    برای هر گزینه راهنمای جداگانه ای تنظیم کرده ایم.
                </p>
                <p>
                    برای حفظ کارایی و عدم شلوغی فضای کار، برخی گزینه ها را به طور موقت مخفی کرده ایم که میتوانید با کلیک
                    روی کلید
                    <mark>نمایش گزینه های بیشتر</mark>
                    آنها را قابل نمایش نموده و تنظیم کنید.
                </p>
                <figure>
                    <div class="img-holder" style="padding-bottom: 40.7407%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-slide-options2x.png"
                             width="2160" height="880">
                    </div>
                    <figcaption class="zigzag">لیست اسلایدها و گزینه های اسلاید</figcaption>
                </figure>

                <h2 data-target="builder-slide-manage">مدیریت اسلایدها</h2>
                <div class="table">
                    <table class="fr-150">
                        <thead>
                        <tr>
                            <th>عملیات</th>
                            <th>توضیحات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>نامگذاری اسلاید</td>
                            <td>
                                شما میتوانید یک اسلاید را با دوبارکلیک روی نام آن در نوار سربرگ ها تغییر نام دهید.
                                نام جدید را بنویسید، سپس کلید
                                You can rename a slide by double-clicking on its name in the tab bar. Type the new name,
                                then press
                                <button class="key key-wide key-enter"></button>
                                را بر روی صفحه کلید فشار دهید، یا یک جای دیگر بر روی صفحه کلیک کنید، تا ذخیره شود.
                            </td>
                        </tr>
                        <tr>
                            <td>تغییر اولویت اسلایدها</td>
                            <td>برای تغییر اولویت نمایش اسلایدها، سربرگ آنها را با هم تعویض کنید، برای اینکار کافیست،
                                سربرگ اسلاید را بکشید روی اسلاید دیگر تا اولویت هایشان جابجا شود.
                            </td>
                        </tr>
                        <tr>
                            <td>تکثیر اسلایدها</td>
                            <td>روی <code>کپی برداری از این اسلاید</code>
                                کلیک کنید، تا یک اسلاید شبیه این برای شما ساخته شود.
                                اسلاید جدید دقیقا همه ی تنظیماتی که روی این اسلاید انجام دادید را به همراه دارد.
                                اگر میخواهید یک تغییراتی در این اسلاید دهید که اصلی سر جای خود بماند،
                                میتوانید از این ویژگی استفاده کنید.
                            </td>
                        </tr>
                        <tr>
                            <td>مخفی سازی اسلایدها</td>
                            <td>
                                مخفی کردن یک اسلاید باعث میشود که در نمایش سایت دیده نشود،
                                اما شما آن را میبینید :)
                                این ویژگی به شما کمک می کند، اسلایدهای خود را حین ساخت، نیمه کاره رها کنید ولی بقیه ی
                                اسلایدها را به نمایش بگذارید.
                            </td>
                        </tr>
                        <tr>
                            <td>پاک کردن اسلاید</td>
                            <td>سربرگ اسلاید را انتخاب کنید و کلید <i class="dashicons dashicons-dismiss"
                                                                      style="color: #df3a36;"></i>

                                که روی سربرگ اسلاید انتخاب شده ظاهر میشود را فشار دهید، تا اسلاید حذف شود.
                                این حذف قابل بازگشت نیست.
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <h2 data-target="builder-slide-transitions">درباره ی انیمیشن های اسلایدها</h2>
                <p>
                    این اسلاید ساز بیش از 200 انیمیشن از پیش آماده شده را برای جابجایی صفحات اسلاید در اختیار شما قرار
                    میدهد.
                    این انیمیشن ها هم دو بعدی هستند و هم سه بعدی.
                    با استفاده از
                    <a href="#transition-builder">ویرایش انیمیشن</a>
                    میتوانید تعداد آنها را گسترش دهید و انیمیشن های دلخواه خود را ایجاد کنید.
                    انیمیشن های جابحایی اسلاید ها فقط از تصویر زمینه اسلاید حال حاضر و اسلاید بعدی، برای ساخت جلوه های
                    ویژه ی بصری استفاده می کنند.
                </p>
                <p>
                    مرورگرهای مدرن اینترنت باید ویژگی نمایش انیمیشن های سه بعدی را داشته باشند تا بتوانید انیمیشن های سه
                    بعدی را روی آنها نمایش دهید.
                    در صورتی که مرورگر کاربر امکان نمایش انیمیشن سه بعدی انتخابی شما را نداشته باشد، سیستم اسلاید یک
                    انیمیشن دو بعدی را به وی نشان میدهد.
                    این در صورتیست که شما همزمان انیمیشن های دو بعدی و سه بعدی را برای یک اسلایدر انتخاب کنید،
                    در این صورت، سیستم اسلایدساز به طور خودکار بر اساس توانایی سیستم کاربر در نشان داده جلوه های ویژه،
                    اینیمشن ها را اجرا خواهد کرد.
                </p>


                <h2 data-target="builder-slide-linking">لینک دهی اسلایدها</h2>
                <p>
                    لینک دادن اسلاید آن را قابل کلیک می کند،
                    همچنین شما میتوانید لایه های خود را لینک دهی کنید تا با کلیک بر روی آنها، لینک مورد نظر شما آنطور که
                    تنظیم
                    کرده اید باز شود.
                    توجه داشته باشید که لایه ها،
                    روی اسلایدها قرار میگیرند.
                    بنابراین اگر همزمان به یک لایه و خود اسلاید لینک دهی کنید،
                    جایی که نشانگر ماوس روی یک لایه قرار گرفته،
                    لینک آن لایه مقدم است.
                </p>

                <h3>لینک های هوشمند</h3>
                <p>
                    لینک های هوشمند میتوانند اسلایدشو و حتی ناوبری بین اسلایدها،
                    و اجزای صفحه را کنترل کنند.
                    فقط کافیست یکی از آیتم های انتخابی را که در اختیار شماست انتخاب کنید،
                    سپس محتوای لینک شده به طور خودکار با اسلاید شما گره میخورد.
                    این بدین معنیست که میتوانید به نوشته یا آیتمی بر روی صفحه اشاره کنید،
                    و کاربر با کلیک روی این لایه به آن نوشته روی همان صفحه منتقل شود.
                </p>
                <div class="table">
                    <table>
                        <thead>
                        <tr>
                            <th>لینک</th>
                            <th>عملگر</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>#start</td>
                            <td>اگر اسلاید متوقف شده(pause) آن را مجددا پخش می کند.</td>
                        </tr>
                        <tr>
                            <td>#stop</td>
                            <td>پخش اسلاید را متوقف می کند.</td>
                        </tr>
                        <tr>
                            <td>#prev</td>
                            <td>صفحه ی اسلاید قبلی را باز می کند.</td>
                        </tr>
                        <tr>
                            <td>#next</td>
                            <td>صفحه ی اسلاید بعدی را باز می کند.</td>
                        </tr>
                        <tr>
                            <td>#replay</td>
                            <td>اسلاید را ریست می کند و از اسلاید اول شروع به پخش می کند.</td>
                        </tr>
                        <tr>
                            <td>#reverse</td>
                            <td>مجددا اسلاید را پخش می کند، و منتظر میماند انیمیشن های این صفحه پایان یابد، سپس صفحه ی
                                اول اسلاید را نمایش می دهد.
                            </td>
                        </tr>
                        <tr>
                            <td>#reverse-replay</td>
                            <td>اسلاید را پخش می کند، همه ی انیمیشن ها برگشت داده میشوند و بقیه ی صفحات در حالت عادی
                                نمایش داده می شوند.
                            </td>
                        </tr>
                        <tr>
                            <td>#
                                <mark>{n}</mark>
                            </td>
                            <td>
                                به صفحه ی اسلاید دیگری میرود.
                                باید مقدار
                                <mark>{n}</mark>
                                را با شماره ی اسلاید جایگزین کنید، برای مثال #3
                                به اسلاید شماره ی 3 نقل مکان می کند.
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <h3>لینک عمیق(DeepLink)</h3>
                <p>
                    شما میتوانید از لینک عمیق برای دادن لینک هایی خاص به کاربران خود استفاده کنید.اینجا جای توضیح این
                    قابلیت نیست، اما
                    برای اطلاعات بیشتر میتوانید به
                    <a href="http://persianmoz.com/%D9%84%DB%8C%D9%86%DA%A9%E2%80%8C%D8%B3%D8%A7%D8%B2%DB%8C-%D8%B9%D9%85%DB%8C%D9%82-%DA%86%DB%8C%D8%B3%D8%AA%D8%9F-deep-link/"
                       target="_blank">
                        این لینک آموزشی
                    </a>
                    مراجعه کنید تا با کاربردهای لینک عمیق بیشتر آشنا شوید.
                </p>
                <div class="km-notification info cf">
                    <span class="dashicons dashicons-info"></span>
                    توجه داشته باشید که لینک عمیق میتواند به شما کمک کند که کاربر را از خارج سایت به این اسلاید هدایت
                    کنید،
                    اما با لینک عمیق نمیتوانید بین اسلایدها جابجا شوید و فقط میتوانید
                    برای انکار از لینک های هوشمند استفاده کنید.
                </div>
            </article>

            <!-- Using the Slider Builder: Preview Area -->
            <article>
                <h1 data-target="builder-preview-features">امکانات محدوده ی پیش نمایش</h1>
                <p>بخش پیش نمایش امکانات مخفی زیادی دارد،
                    که میتواند به شدت بهره وری حاصل کار شما را افزایش دهد.
                </p>
                <figure>
                    <div class="img-holder" style="padding-bottom: 46.6204%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-preview-area2x.jpg"
                             width="2160" height="1007">
                    </div>
                    <figcaption class="zigzag">یک تصویر از بخش پیش نمایش اسلایدساز</figcaption>
                </figure>
                <h3>نوار ابزار بخش پیش نمایش</h3>
                <div class="table">
                    <table>
                        <thead>
                        <tr>
                            <th>امکانات</th>
                            <th>توضیحات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>بزرگنمایی</td>
                            <td>
                                دایره ی لغزنده را جابجا کنید تا میزان بزگنمایی اسلاید را تغییر دهید.
                                این ویژگی به شما زمانی کمک می کند که در حال ساخت یک اسلایدر بزرگ روی یک دستگاه با صفحه
                                نمایش کوچک هستید.
                            </td>
                        </tr>
                        <tr>
                            <td>تناسب خودکار</td>
                            <td>میزان بزرگنمایی اسلایدر را با اندازه ی صفحه نمایش دستگاه شما تنظیم می کند.</td>
                        </tr>
                        <tr>
                            <td>تراز لایه ها</td>
                            <td>شما میتوانید خیلی سریع لایه های درون صفحه را با یک سمت صفحه تراز کنید.</td>
                        </tr>
                        <tr>
                            <td>حرگت قبل/حرکت بعد</td>
                            <td>زمانی کاربرد دارد که اشتباها چیزی را در صفحه جابجا کنید، و میخواهید آنرا بازگردانی کنید.
                                یا اشتباها لایه ای را پاک کرده اید و میخواهید آن را برگردانید.
                            </td>
                        </tr>
                        <tr>
                            <td>پیش نمایش اسلایدر</td>
                            <td>
                                یک پیش نمایش از آنجه کاربر در نهایت قرار است ببیند برای شما به نمایش میگذارد، که شامل
                                اینیمیشن ها و رفتار لایه ها میباشد.
                            </td>
                        </tr>
                        <tr>
                            <td>پیش نمایش لایه</td>
                            <td>
                                یک پیش نمایش از رفتار لایه ای را که انتخاب نموده اید به شما نشان میدهد، که برای تراز
                                کردن انیمیشن
                                هر لایه در اسلایدر کاربردیست.
                            </td>
                        </tr>
                        <tr>
                            <td>نمای دستگاه ها</td>
                            <td>
                                شما میتوانید هر لایه را برای دستگاه خاصی تنظیم کنید.
                                یعنی ممکن است نخواهید یک لایه بر روی تبلت یا موبایل نمایش داده شود و حتی بلعکس،
                                با این گزینه شما میتوانید اندازه ی لایه ها در دستگاه های مختلف را نیز تنظیم کنید.
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <h3>امکانات مخفی</h3>
                <div class="table">
                    <table>
                        <thead>
                        <tr>
                            <th>امکانات</th>
                            <th>توضیحات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>آپلود عکس ها</td>
                            <td>شما میتوانید یک تصویر را از روی my computer خود مستقیما روی بخش پیش نمایش رها کنید تا به
                                صورت خودکار آپلود
                                و به لایه های شما اضافه شود.
                            </td>
                        </tr>
                        <tr>
                            <td>انتخاب چند تایی</td>
                            <td>
                                شما میتوانید همانند فتوشاپ یا امکانات رایانه ی خود جند لایه را با هم انتخاب کنید و روی
                                آنها اعمالی نظیر تغییر سایز، حذف، و جابجایی را انجام دهید.
                                این کار به دو روش درگ کردن ماوس روی لایه ها و انتخاب آنها، و کلیک ماوس و نگه داشتن کلید
                                Ctrl/Cmd صفحه کلید قابل انجام است.
                            </td>
                        </tr>
                        <tr>
                            <td>جابجایی لایه ها</td>
                            <td>همانند دستگاه های رایانه شما میتوانید با درگ کردن ماوس و انتخاب چند لایه، آنها را جابجا
                                کنید.
                                یا از کلید Ctrl/Cmd صفحه کلید برای اینکار استفاده کنید.
                            </td>
                        </tr>
                        <tr>
                            <td>تغییر اندازه ی لایه ها</td>
                            <td>
                                میتوانید با استفاده از ماوس یک یا چند لایه را انتخاب کرده و همه ی آنها را با هم تغییر
                                اندازه دهید.
                            </td>
                        </tr>
                        <tr>
                            <td>خط کشی ها</td>
                            <td>
                                روی یکی از نوارهای خط کشی، کلید ماوس را فشار دهید و نگهدارید،
                                حالا میتوانید ماوس را در حالی که کلید را پایین نگه داشته اید، به طور عمودی جابجا کنید.
                                همانطور که میبینید گایدلاین هایی برای تراز کردن لایه ها روی صفحه رسم میشوند، درست مانند
                                فتوشاپ.
                            </td>
                        </tr>
                        <tr>
                            <td>ویرایش متن</td>
                            <td>
                                یک لایه ی متنی را انتخاب کنید،کلید Enter روی صفحه کلید را فشار دهید یا روی آن دوبار کلیک
                                کنید،
                                لایه به حالت ویرایش تغییر حالت میدهد.
                                این به شما این امکان را میدهد که لایه های متنی خود را مستقیما در ناحیه ی
                                پیش نمایش تنظیم کنید.
                            </td>
                        </tr>
                        <tr>
                            <td>همپوشانی لایه ها</td>
                            <td>
                                گاهی لایه ها در صحنه روی هم قرار میگیرند و شما باید تنظیم کنید
                                که کدام لایه باید روی آن یکی قرار گیرد.
                                جایی که دو یا چند لایه روی هم قرار گرفته اند، کلیک راست کنید
                                و لایه ای را که باید روی بقیه ی لایه ها قرار گیرد را انتخاب کنید.
                            </td>
                        </tr>
                        <tr>
                            <td>کلید های صفحه کلید</td>
                            <td>به <a href="#builder-shortcuts">کلیدهای صفحه کلید</a>
                                مراجعه کنید
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>
            </article>


            <!-- Using the Slider Builder: Adding layers -->
            <article>

                <h1 data-target="layer-options">افزودن لایه ها</h1>
                <figure>
                    <div class="img-holder" style="padding-bottom: 23.287%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-layers2x.png"
                             width="2160" height="503">
                    </div>
                    <figcaption class="zigzag">لیست لایه ها و گزینه های لایه ها</figcaption>
                </figure>

                <h2 data-target="builder-manage-layers">مدیریت لایه ها</h2>
                <div class="table">
                    <table class="fr-150">
                        <thead>
                        <tr>
                            <th>امکانات</th>
                            <th>توضیحات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>نام گذاری لایه ها</td>
                            <td>
                                ساخت اسلاید حرفه ای نیاز به نظم در قطعات ساخت دارد.
                                پس توصیه می کنیم حتما برای لایه های خود یک نام تنظیم کنید.
                            </td>
                        </tr>
                        <tr>
                            <td>اولولت بندی لایه ها</td>
                            <td>
                                شما میتوانید با کشیدن و رها کردن لایه ها با استفاده از آیکون
                                <i class="dashicons dashicons-menu black"></i>
                                اولویت آنها را از بالا به پایین تغییر دهید.
                                این عمل زمانی که لایه ها با یکدیگر همپوشانی دارند،
                                خیلی کاربردیست و مشخص میکند کدام لایه روی آن یکی قرار گرفته است.
                                فرض کنید در اسلاید خود یک میز را نمایش میدهید که روی آن چند کتاب قرار دارد.
                                حال در اینجا نشان میدهید کدام کتاب روی دیگری قرار گرفته.
                            </td>
                        </tr>
                        <tr>
                            <td>قفل کردن لایه ها</td>
                            <td>قفل کردن لایه ها با آیکون <i class="dashicons dashicons-lock black"></i>
                                قابل انجام است
                                که اجازه ی جابجایی یا پاک شدن لایه را از کاربر سلب می کند.
                            </td>
                        </tr>
                        <tr>
                            <td>مخفی سازی لایه ها</td>
                            <td> مخفی سازی لایه ها با استفاده از آیکون <i
                                        class="dashicons dashicons-visibility black"></i>
                                قابل انجام است،زمانی که کمرنگ است، یعنی یک لایه مخفی است و نمایش داده نمیشود و زمانی که
                                پر رنگ باشد
                                بدین معنیست که لایه قابل نمایش است و در نسخه ی نهایی نمایش داده میشود.
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <h2 data-target="builder-layer-types">انواع لایه ها</h2>
                <div class="table">
                    <table class="fr-150">
                        <thead>
                        <tr>
                            <th>نوع</th>
                            <th>هدف</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>
                                <span class="dashicons dashicons-format-image"></span>
                                تصویر
                            </td>
                            <td>
                                یک تصویر برای نمایش روی اسلاید ایجاد می کند،
                                شما میتوانید یک فایل را در همینجا آپلود کنید و در اسلاید استفاده کنید، یا از تصاویر از
                                قبل آپلود شده در
                                سایت استفاده کنید.
                                همچنین میتوانید لینک یک تصویر را از سایت دیگر وارد کنید.اما اگر آن سایت تصویر را حذف
                                کند، از اسلاید شما هم حذف میشود.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <span class="dashicons dashicons-text"></span>
                                متن
                            </td>
                            <td>
                                میتوانید روی اسلاید خود متن های منظم قرار دهید که از تگ های HTML مدیریت متن هم پشتیبانی
                                میکند.
                                پی متن شما میتواند یک پاراگراف، یا یک کلید کوچک باشد.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <span class="dashicons dashicons-editor-code "></span>
                                HTML
                            </td>
                            <td>
                                اگر کد نویسی به زبان HTML را یاد دارید میتوانید کد مخصوص خود را به عنوان یک لایه در
                                اینجا بسازید.
                                لطفا توجه داشته باشید لایه ای که با کد میسازید &lt;div&gt; ساخته میشود
                                بنابر این نیازی نیست حتما برای آن یک قاب بسازید.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <span class="dashicons dashicons-video-alt3"></span>
                                صوتی تصویری
                            </td>
                            <td>
                                این نوع از لایه به شما امکان استفاده از رسانه های از قبل رزرو شده را میدهد.
                                انتخاب کنید که کدام نوع محتوا را برای اعمال روی یک لایه نیاز دارید.
                                شما میتوانید محتواهای مذکور را بر روی کد های HTML نیز سوار کنید و از این بخش استفاده
                                نکنید.
                                به هر حال برای استفاده از امکانات مالتی مدیا به این لایه نیاز خواهید داشت.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <span class="dashicons dashicons-admin-post"></span>
                                محتوای داینامیک
                            </td>
                            <td>
                                اگر میخواهید از پست های سایت خود استفاده کنید، میتوانید، نوع لایه را روی داینامیک تنظیم
                                کنید تا به محتوای منتشر شده در سایت خود دسترسی داشته باشید.
                                برای اطلاعات بیشتر
                                <a href="#dynamic-layers">استفاده از لایه های داینامیک</a>
                                را مطالعه کنید.
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <h2 data-target="builder-layer-devices">دستگاه های پشتیبانی شده</h2>
                <p>
                    این امکان وجود دارد که لایه های مختلف برای نمایش در دستگاه های مختلف را در یک صفحه ی اسلاید بسازید.
                    این کار با مخفی سازی و آشکار سازی لایه ها برای دستگاه های مختلف قابل انجام است.
                    با استفاده از کلید
                    <mark>نمایش این لایه در دستگاه های زیر</mark>
                    میتوانید تنظیم کنید که این لایه در کدام دستگاه ها قابل نمایش باشد.
                </p>
                <figure>
                    <div class="img-holder" style="padding-bottom: 6.99301%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-layer-devices2x.png"
                             width="1144" height="80">
                    </div>
                    <figcaption>انتخاب دستگاه ها برای نمایش یک لایه</figcaption>
                </figure>

                <div class="table">
                    <table>
                        <thead>
                        <tr>
                            <th>آیکون</th>
                            <th>نقش</th>
                            <th>ملاحظات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td><i class="dashicons dashicons-desktop"></i></td>
                            <td>نمایش یا عدم نمایش لایه در دستگاه های دسکتاپ</td>
                            <td>عرض دستگاه &gt; 1024px</td>
                        </tr>
                        <tr>
                            <td><i class="dashicons dashicons-tablet"></i></td>
                            <td>نمایش یا عدم نمایش لایه در دستگاه های تبلت</td>
                            <td>عرض دستگاه &gt;= 768px and &lt;= 1024px</td>
                        </tr>
                        <tr>
                            <td><i class="dashicons dashicons-smartphone"></i></td>
                            <td>نمایش یا عدم نمایش لایه در دستگاه های تلفن همراه</td>
                            <td>عرض دستگاه &lt;= 767px</td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <h2 data-target="builder-layer-media">جاسازی ویدیوها</h2>
                <p>
                    این اسلایدساز از سیستم های Vimeo,youtube و ویدیوها و صداهای اپلود شده در سایت پشتیبانی می کند.
                    این بخش شامل همه ی تنظیماتی که برای مدیریت نمایش محتوای جند رسانه ای مورد نیاز است میباشد.
                </p>
                <p>فقط نوع لایه ی <code>تصویری/صوتی</code>
                    را انتخاب کنید.
                    برای کد های یوتیوپ یا ویمئو یا آپارات، کدهایی که سایت های آنها برای نمایش در اختیار شما گذاشته اند
                    را در این بخش بچسبانید.
                    در غیر اینصورت کلید
                    <code>افزودن رسانه</code> را برای انتخاب صوت و تصویر از درون سایت خودتان انتخاب کنید.</p>

                <p>
                    برای استفاده از محتوای صوتی تصویری از درون سایت خودتان اطمینان پیدا کنید که نوع فایل توسط اسلایدساز
                    پشتیبانی می شود.


                    <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Supported_media_formats#Browser_compatibility"
                       target="_blank">اینجا</a>
                    لیستی از محتواهای قابل پشتیبانی وجود دارد.

                    توصیه می کنیم از فرمت های
                    <mark>MP3</mark>
                    یا
                    <mark>AAC in MP4</mark>
                    برای صدا
                    , و
                    <mark>VP8+Vorbis in WebM</mark>
                    یا
                    <mark>H.264+MP3/AAC in MP4</mark>
                    برای ویدیو استفاده کنید.
                    ممکن است پشتیبانی فرمت ها در مرورگر های مختلف متفاوت باشد، بنابر این سعی کنید یک فیلم را با چند فرمت
                    ذکر شده در لیست آپلود کنید و همه را با هم در اینجا استفاده کنید.
                </p>

                <p>
                    برای دسترسی های بیشتر، کاربرانی که آشنا به برنامه نویسی وب هستند میتوانند از
                    <a href="#layerslider-api">LayerSlider API</a>
                    نیز استفاده کنند.
                </p>

                <h2 data-target="builder-layer-shortcode">کدهای کوتاه و محتوای هوشمند</h2>
                <p>
                    شما میتوانید از کدهای کوتاه محتوای سایت برای استفاده در اسلایدها استفاده کنید.
                    اما فراموش نکنید که این محتوا فقط بر روی فرانت اند سایت قابل نمایش از و در بخش پیش نمایش قابل نمایش
                    نیست.

                </p>


                <h2 data-target="builder-layer-transitions">انیمیشن های لایه</h2>
                <p>
                    اینجا همان مکانیست که شما انیمیشن های لایه های خود را میسازید.
                    این بخش خود به چند بخش تقسیم میشود که توضیحات هر بخش در داخل پنل مدیریت داده شده است.
                </p>

                <ul>
                    <li>
                        <mark>خواندن تولتیپ ها</mark>
                        توصیه می کنیم به علت پیچیده بودن تنظیمات این بخش، حتما راهنماهای هر گزینه ای را که نمیدانید،
                        با نگهداشتن نشانگر ماوس بر روی آن مطالعه کنید.
                    </li>
                    <li>
                        <mark>استفاده از پیش نمایش:</mark>
                        در محدوده ی پیش نمایش و با فعال سازی حالت پیش نمایش اسلاید شمامیتوانید کار انجام شده ی خود را در
                        عمل مشاهده کنید.
                    </li>
                    <li>
                        <mark>استفاده از قالب های آماده:</mark>
                        همانطور که در بخش <a href="#demo-sliders">مقدمات شروع / وارد کردن قالب های آماده ی اسلاید</a>
                        عنوان شد، میتوانید از بخش فروشگاه قالب های آماده، قالب های حرفه ای از پیش ساخته شده ای را به
                        سیستم وارد کنید،
                        و از آنها برای یادگیری اینکه چطور این تنظیمات را تغییر دهید، استفاده کنید.
                    </li>
                </ul>

                <figure>
                    <div class="img-holder" style="padding-bottom: 55.2315%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-layer-transitions2x.png"
                             width="2160" height="1193">
                    </div>
                    <figcaption class="zigzag">یک تصویر از بخش تنظیم انیمیشن ها</figcaption>
                </figure>


                <h2 data-target="builder-layer-linking">لینک دهی لایه ها</h2>
                <p>
                    شما میتوانید به یک لایه در سربرگ
                    <code>لینک و ویژگی ها</code>
                    لینک دهی کنید.
                    یک لینک وارد کنید، و تنظیم کنید که این لینک چطور باز شود، مثلا در همین صفحه بارگذاری شود، یا در یک
                    تب یا پنجره ی جدید در مرورگر باز شود.
                </p>
                <p>
                    لینک های هوشمند هم برای کنترل اسلایدها و ناوبری بین آنها قابل قبول هستند و میتوانید از آنها در اینجا
                    استفاده کنید.
                    فقط کافیست یکی از آنها را از جدول زیر انتخاب کنید و وارد کنید.
                </p>
                <div class="table">
                    <table>
                        <thead>
                        <tr>
                            <th>لینک</th>
                            <th>عملگر</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>#start</td>
                            <td>اگر اسلاید متوقف شده(pause) آن را مجددا پخش می کند.</td>
                        </tr>
                        <tr>
                            <td>#stop</td>
                            <td>پخش اسلاید را متوقف می کند.</td>
                        </tr>
                        <tr>
                            <td>#prev</td>
                            <td>صفحه ی اسلاید قبلی را باز می کند.</td>
                        </tr>
                        <tr>
                            <td>#next</td>
                            <td>صفحه ی اسلاید بعدی را باز می کند.</td>
                        </tr>
                        <tr>
                            <td>#replay</td>
                            <td>اسلاید را ریست می کند و از اسلاید اول شروع به پخش می کند.</td>
                        </tr>
                        <tr>
                            <td>#reverse</td>
                            <td>مجددا اسلاید را پخش می کند، و منتظر میماند انیمیشن های این صفحه پایان یابد، سپس صفحه ی
                                اول اسلاید را نمایش می دهد.
                            </td>
                        </tr>
                        <tr>
                            <td>#reverse-replay</td>
                            <td>اسلاید را پخش می کند، همه ی انیمیشن ها برگشت داده میشوند و بقیه ی صفحات در حالت عادی
                                نمایش داده می شوند.
                            </td>
                        </tr>
                        <tr>
                            <td>#closepopup</td>
                            <td>را میبندد<a href="#popups">بازشو</a>.</td>
                        </tr>
                        <tr>
                            <td>#{n}</td>
                            <td>به صفحه ی اسلاید دیگری میرود. باید مقدار
                                {n}
                                را با شماره ی اسلاید جایگزین کنید، برای مثال #3 به اسلاید شماره ی 3 نقل مکان می کند.
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <h2 data-target="builder-layer-attributes">ویژگی های لایه</h2>
                <p>
                    شما میتوانید ویژگی های سفارشی ای را به لایه های خود بچسبانید که بیشتر به درد برنامه نویسان وب میخورد
                    و در حالت عادی استفاده نمیشود.
                    یک لیست از مواردی که خیلی مورد استفاده ی برنامه نویسان وب قرار میگیرد در پنل قرار داده شده است که
                    امکان گسترش دادن آن نیز وجود دارد.
                </p>
                <p>
                    خیلی از پلاگین ها از ویژگی های مخصوص خود در تگ های HTML استفاده می کنند که اینجا میتوانید آن ویژگی
                    ها را به لایه های خود بیفزایید.
                    برای مثال میتوانید لینک دهید به
                    <a href="#third-party-fancybox">ایجاد گالری fancybox</a>
                </p>


                <h2 data-target="builder-layer-styles">سبک لایه</h2>
                <p>در سربرگ <code>سبک</code>
                    مربوط به لایه ی مورد نظرتان، شما میتوانید تنظیماتی برای زیباسازی و کنترل ظاهر لایه ی خود پیدا کنید.
                    توصیه ی اکید دارید که این بخش را به خوبی یاد بگیرید و از آن استفاده های زیادی داشته باشید.
                    این بخش در واقع یک رابط کاربری برای تنظیم ویژگی های CSS یک لایه است،
                    بنابراین، به دلیل اینکه خیلی از افراد این کدها را بلد نیستند، این رابط کاربری به آنها کمک می کند.
                    اگر نیاز به افزودن ویژگی های بیشتری دارید، میتوانید به شکل مستقیم از کد های CSS در این بخش استفاده
                    کنید،
                    که در پایین صفحه باکسی برای وارد کردن این کدها تعبیه شده است.
                </p>
                <p>در این بخش شما میتوانید مکان لایه ها را نسبت به صحنه ی اسلاید تنظیم کنید.
                    با استفاده از مقادیر باکس (لایه بندی|اندازه&موقعیت)
                    میتوانید موقعیت لایه را از <code>چپ</code> و <code>بالا</code>
                    نسبت به صحنه تنظیم کنید.
                    البته میتوانید این کار را مستقیما در ویرایشگر بصری در بخش پیش نمایش هم انجام دهید، اما اینجا دقیقتر
                    است.:)
                </p>

            </article>

            <article>
                <h1 data-target="builder-image-editor">ویرایشگر تصویر</h1>
                <p>
                    این اسلایدساز به لطف شرکت ADOBE که یک ویرایشگر حرفه ای تحت وب تولید نموده است،
                    میتواند به شما امکان ویرایش حرفه ای تصاویر و لایه ها را بدهد.
                    این بخش از اسلاید ساز واقعا یک نمونه از فتوشاپ به صورت آنلاین است.:)
                </p>
                <p>
                    جایی که یک تصویر را از کتابخانه ی رسانه ی خود انتخاب میکنید، یک آیکون به اینشکل
                    <img src="<?= $asset_dir.'/img' ?>/adobe-cc-logo.jpg"
                         class="adobe-cc-logo">
                    نمایان میشود.
                    با کلیک بر روی آن، ویرایشگر حرفه ای تصویر باز میشود.

                </p>

                <figure>
                    <div class="half">
                        <div class="img-holder" style="padding-bottom: 43.8554%;">
                            <img src="<?= $asset_dir.'/img' ?>/illustration-image-editor-button2x.jpg"
                                 width="830" height="364">
                        </div>
                    </div>
                    <figcaption>تصویری از کلید ویرایشگر حرفه ای تصویر</figcaption>
                </figure>
                <figure>
                    <div class="img-holder" style="padding-bottom: 72.8032%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-image-editor2x.jpg"
                             width="2515" height="1831">
                    </div>
                    <figcaption>تصویری از ویرایشگر حرفه ای تصویر</figcaption>
                </figure>
            </article>

            <article>
                <h1 data-target="builder-popout">ویرایشگر جداشونده</h1>
                <p>
                    یکی از اهدافی که این اسلایدر برای طراحی بهتر دنبال می کند این است که شما همزمان با طراحی یک لایه
                    بتوانید سریعا نتیجه ی آن را ببینید.
                    اگر دقت کرده باشید، قاب پیش نمایش با قاب تنظیم ویژگی های لایه ها فاصله ی زیادی دارد،
                    این باعث میشود نتوانید همزمان هر دوی آنها را ببینید.
                    اما این مشکل برطرف میشود، زمانی که روی کلید
                    <code><i class="dashicons dashicons-external"></i>نمایش ویرایشگر در پنجره ی جدا</code>
                    کلیک کنید.
                    این کلید درست روی نوار ویژگی های لایه ها قرار دارد. و ویرایشگر شما را از جا میکند و شما میتوانید آن
                    را به بالای صفحه بکشید تا همزمان کنار پنجره ی طراحی قرارگیرید.
                    برای استفاده از این ویژگی بهتر است از مانیتور عریض استفاده کنید.
                </p>
                <figure>
                    <div class="img-holder" style="padding-bottom: 60.2429%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-popout-editor2x.jpg"
                             width="2470" height="1488">
                    </div>
                    <figcaption>تصویری از ویرایشگر جداشده ی لایه ها</figcaption>
                </figure>
            </article>

            <!-- Timeline -->
            <article>
                <h1 data-target="builder-timeline">خط زمان</h1>
                <p>
                    خط زمان، در واقع توالی لایه ها نسبت به یک دیگر بر روی محور زمان را نشان میدهد.
                    اینکه کدام زودتر اجرا میشوند،کدام یک از اینیمشن های متن استفاده می کند و یا کدام یک در جه ثانیه از
                    از صفحه خارج میشود، همه در خط زمان قابل مشاهده است.
                    نمایشگر خط زمان، انواع انیمیشن ها را با رنگ های مختلف تگ گذاری میکند که تیتر هر رنگ را میتوانید
                    پایین باکس زمان مشاهده کنید.
                    برای مشاهده ی نتیجه ی نمایش اسلاید بر اساس زمان، میتوانید روبان قرمز رنگ بالای باکس را روی محور افقی
                    بکشید، تا نتیحه را در ناحیه ی پیش نمایش مشاهده کنید.
                </p>
                <figure>
                    <div class="img-holder" style="padding-bottom: 27.6852%;">
                        <img src="<?= $asset_dir.'/img' ?>/illustration-timeline2x.png"
                             width="2160" height="598">
                    </div>
                    <figcaption class="zigzag">تصویری از پنل خط زمان</figcaption>
                </figure>
            </article>


            <!-- Using the Slider Builder: Keyboard shortcuts -->
            <article>
                <h1 data-target="builder-shortcuts">کلیدهای صفحه کلید</h1>
                <div class="km-notification warning cf">
                    <span class="dashicons dashicons-warning"></span>
                    کلید های ترکیبی صفحه کلید ممکن است زمانی که شما در حال پر کردن آیتم های فرم های درون صفحه هستید،
                    به درستی کار نکند، اما در محیط ویراشگر بصری عالی عمل می کند.
                    برای اینکه از حالت ویرایش فرم خارج شوید، کافیست یکی از کلیدهای
                    <button class="key key-wide key-enter"></button>
                    را فشار دهید.
                    سپس همه ی کلیدهای ترکیبی فعال میشوند.
                </div>


                <h3>کلیدهای ترکیبی رابط کاربری اصلی</h3>
                <div class="table keyboard-shortcuts">
                    <table>
                        <thead>
                        <tr>
                            <th>کلیدها</th>
                            <th>توضیحات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>
                                <button class="key key-wide key-enter"></button>
                                <span>در ورودی های متنی</span></td>
                            <td>تمرکز نشانگر را از روی آیتم های ورودی متن میگیرد تا همه ی کلیدهای ترکیبی مجددا قابل
                                استفاده شوند.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <button class="key key-wide key-enter"></button>
                                <span>روی لایه ی انتخاب شده</span></td>
                            <td>تغییر حالت ویرایش در لایه انتخاب شده، بنابراین شما می توانید متن لایه در منطقه پیش نمایش
                                را تغییر دهید.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <button class="key key-wide key-ctrl"></button>
                                +
                                <button class="key">Z</button>
                            </td>
                            <td>بازگشتن به حرکت قبلی ای که انجام داده بودید.</td>
                        </tr>
                        <tr>
                            <td>
                                <button class="key key-wide key-ctrl"></button>
                                +
                                <button class="key">Y</button>
                                <span class="nl">یا</span><br>
                                <button class="key key-wide key-ctrl"></button>
                                +
                                <button class="key key-wide key-shift"></button>
                                +
                                <button class="key">Z</button>
                            </td>
                            <td>انجام دادن مجدد حرکتی که بازگردانی کردید</td>
                        </tr>
                        <tr>
                            <td>
                                <button class="key key-wide key-ctrl"></button>
                                +
                                <button class="key">S</button>
                            </td>
                            <td>ذخیره ی تنظیمات انجام شده در اسلایدر</td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <h3>عملیات اسلایدها</h3>
                <div class="table keyboard-shortcuts">
                    <table>
                        <thead>
                        <tr>
                            <th>کلیدها</th>
                            <th>توضیحات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>
                                <button class="key key-wide key-space"></button>
                            </td>
                            <td>وارد حالت پیش نمایش میشود تا نتیجه ی کار را نمایش دهد.</td>
                        </tr>
                        <tr>
                            <td>
                                (
                                <button class="key key-wide key-alt"></button>
                                /
                                <button class="key key-wide key-shift"></button>
                                ) +
                                <button class="key key-wide key-space"></button>
                            </td>
                            <td>تغییر حالت پیش نمایش به نمایش انیمیشن های لایه یا لایه های انتخاب شده</td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <h3>مدیریت لایه ها</h3>
                <div class="table keyboard-shortcuts">
                    <table>
                        <thead>
                        <tr>
                            <th>کلیدها</th>
                            <th>توضیحات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>
                                <button class="key key-wide key-ctrl"></button>
                                +
                                <button class="key">C</button>
                            </td>
                            <td>لایه های انتخابی را کپی می کند، پس شما میتوانید آنها را مجددا در جای دیگری paste کنید.
                                یا در اسلاید دیگری بکار بگیرید.
                                <br>
                                لطفا به یاد داشته باشید:
                                این عملگر با عملیات سیستم عامل شما تداخل دارد.
                                بنابر این برای کپی کردن یک لایه نباید در حال ویرایش متن آن باشید.چون فقط متن آن کپی
                                میشود.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <button class="key key-wide key-ctrl"></button>
                                +
                                <button class="key">X</button>
                            </td>
                            <td>کپی و حذف این لایه در یک حرکت.</td>
                        </tr>
                        <tr>
                            <td>
                                <button class="key key-wide key-ctrl"></button>
                                +
                                <button class="key">V</button>
                            </td>
                            <td>paste کردن لایه در اینجا</td>
                        </tr>
                        <tr>
                            <td>
                                <button class="key key-wide key-ctrl"></button>
                                +
                                <button class="key">D</button>
                            </td>
                            <td>تکثیر لایه های انتخابی با تمام ویژگی هایشان</td>
                        </tr>
                        <tr>
                            <td>
                                <button class="key key-wide key-backspace"></button>
                            </td>
                            <td>پاک کردن لایه های انتخابی</td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <h3>جانمایی لایه ها</h3>
                <div class="table keyboard-shortcuts">
                    <table>
                        <thead>
                        <tr>
                            <th>کلیدها</th>
                            <th>توضیحات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>
                                <div class="arrows">
                                    <button class="key key-arrow-up"></button>
                                    <button class="key key-arrow-right"></button>
                                    <button class="key key-arrow-bottom"></button>
                                    <button class="key key-arrow-left"></button>
                                </div>
                            </td>
                            <td>لایه ها را در هر جهت به اندازه ی یک پیکسل حرکت دهید.</td>
                        </tr>
                        <tr>
                            <td>
                                (
                                <button class="key key-wide key-alt"></button>
                                /
                                <button class="key key-wide key-shift"></button>
                                ) +
                                <div class="arrows">
                                    <button class="key key-arrow-up"></button>
                                    <button class="key key-arrow-right"></button>
                                    <button class="key key-arrow-bottom"></button>
                                    <button class="key key-arrow-left"></button>
                                </div>
                            </td>
                            <td>لایه ها را در هر جهت به اندازه ی 10 پیکسل حرکت دهید.</td>
                        </tr>
                        <tr>
                            <td>
                                <span>نگهدارید</span>
                                <button class="key key-wide key-shift"></button>
                                <span>سپس لایه ها را درگ کنید</span>
                            </td>
                            <td>لایه ها را در محور عمودی یا افقی حرکت دهید</td>
                        </tr>
                        <tr>
                            <td>
                                <span>نگهدارید</span>
                                <button class="key key-wide key-ctrl"></button>
                                <span>سپس لایه ها را درگ کنید</span>
                            </td>
                            <td>
                                خاموش کردن حرکت پرش دار برای جابجایی آزادانه ی لایه
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>

            </article>


        </section>


        <!-- Publishing sliders -->
        <!--<section data-target="publishing-sliders">-->

        <!--<nav>-->
        <!--<ul>-->
        <!--<li>-->
        <!--<a href="#publish-shortcode">Method 1: Shortcodes</a>-->
        <!--<ul>-->
        <!--<li><a href="#publish-shortcode-tool">Editor helper utility</a></li>-->
        <!--</ul>-->
        <!--</li>-->
        <!--<li><a href="#publish-widgets">Method 2: Widget</a></li>-->
        <!--<li><a href="#publish-page-builders">Method 3: Page Builders</a></li>-->
        <!--<li><a href="#publish-php">Method 4: PHP function</a></li>-->
        <!--<li class="sep"><a href="#publish-filters">Using filters to display sliders on specific pages</a></li>-->
        <!--</ul>-->
        <!--</nav>-->

        <!--&lt;!&ndash; Publishing sliders: Via Shortcode &ndash;&gt;-->
        <!--<article data-target="publish-shortcode">-->
        <!--<h1>Method 1: Using shortcodes</h1>-->
        <!--<p>Shortcodes are special placeholders, which you can paste into-->
        <!--the WordPress text editor when editing posts and pages. They will be-->
        <!--automatically replaced with the appropriate content on your front-end-->
        <!--pages. Shortcodes are one of the most commonly used methods of inserting-->
        <!--contents to your site. A lot of other solutions (e.g. page builders in-->
        <!--themes) can also accept LayerSlider shortcodes to add sliders to your-->
        <!--pages.</p>-->

        <!--<p>Each slider has a unique shortcode. You can hover over a slider in your list and click on the <i class="dashicons dashicons dashicons-arrow-down-alt2"></i> icon to reveal slider actions, then select the <code><i class="dashicons dashicons-plus"></i> Embed</code>-->
        <!--option to see its shortcode. You can also find the shortcode of a-->
        <!--slider at the bottom of the Slider Builder page next to the save button.</p>-->

        <!--<p>For advanced customization, you can add a <code>filters</code> attribute to your shortcode to control on which pages the slider should appear. Read the <a href="#publish-filters">Using filters</a> section to learn more. Example shortcode: <code>[layerslider id="1" filters="homepage"]</code></p>-->

        <!--<p>There is also a way to override the "Starting slide" option with the shortcode. Using the <code>firstslide</code>-->
        <!--shortcode parameter you can force embeded sliders to start with the-->
        <!--specified slide, even if the slider has different settings. This is-->
        <!--particularly useful when you want to embed the same slider in multiple-->
        <!--times showing different slides. In the following example we're forcing-->
        <!--the slider to start with the second slide: <code>[layerslider id="1" firstslide="2"]</code></p>-->

        <!--<h2 data-target="publish-shortcode-tool">Editor helper utility</h2>-->
        <!--<p>We've also added a small utility to the WordPress text editor-->
        <!--toolbar. It will pop up a modal window with your most recent sliders to-->
        <!--choose from. After selecting the sliders and changing the embed options-->
        <!--as desired, press the "Insert into post" button to put the corresponding-->
        <!--shortcodes into the editor. See the illustrations below.</p>-->
        <!--<figure>-->
        <!--<div class="img-holder" style="padding-bottom: 34.2857%;">-->
        <!--<img src="<?= $asset_dir.'/img' ?>/illustration-shortcode2x.png" alt="Locating the LayerSlider shortcode " width="1960" height="672">-->
        <!--</div>-->
        <!--<figcaption class="zigzag">Illustration of using shortcodes in WP Post and Pages</figcaption>-->
        <!--</figure>-->

        <!--<figure>-->
        <!--<div class="img-holder" style="padding-bottom: 61.9898%;">-->
        <!--<img src="<?= $asset_dir.'/img' ?>/illustration-shortcode-tool2x.jpg" alt="Inserting the slider via the shortcode tool" width="1176" height="729">-->
        <!--</div>-->
        <!--<figcaption>Using the LayerSlider editor tool to list and insert sliders</figcaption>-->
        <!--</figure>-->
        <!--</article>-->


        <!--&lt;!&ndash; Publishing sliders: Via Widgets &ndash;&gt;-->
        <!--<article data-target="publish-widgets">-->
        <!--<h1>Method 2: Using the LayerSlider widget</h1>-->
        <!--<p>LayerSlider supports widgets, so you can add sliders to your-->
        <!--front-end pages just by a drag n' drop. To do that, navigate to the-->
        <!--Appearance menu on your left sidebar and select "Widgets". Grab the-->
        <!--LayerSlider WP widget and drop it into one of your widget areas.</p>-->

        <!--<p>Please note that some themes may not support a widget area that-->
        <!--you're looking for. In this case, you can create a new widget area by-->
        <!--editing your theme files. <a href="https://codex.wordpress.org/Widgetizing_Themes" target="_blank">Here</a>-->
        <!--is the official documentation about widgetizing your theme. However,-->
        <!--this requires web development knowledge and we don't recommend for users-->
        <!--without experience.</p>-->

        <!--<p>For advanced customization, you can enter custom filters in your-->
        <!--widget settings to control on which pages the slider should appear.-->
        <!--Read the <a href="#publish-filters">Using filters</a> section to learn more.</p>-->

        <!--<p>By entering a custom value into the "Override starting slide"-->
        <!--option field,  you can force embeded sliders to start with the specified-->
        <!--slide, even if the slider has different settings. This is particularly-->
        <!--useful when you want to embed the same slider in multiple times showing-->
        <!--different slides.</p>-->

        <!--<figure>-->
        <!--<div class="img-holder" style="padding-bottom: 49.2777%;">-->
        <!--<img src="<?= $asset_dir.'/img' ?>/illustration-widgets2x.png" alt="Inserting a slider with the LayerSlider WP Widget" width="1869" height="921">-->
        <!--</div>-->
        <!--<figcaption class="zigzag">Inserting a slider with the LayerSlider WP Widget.</figcaption>-->
        <!--</figure>-->
        <!--</article>-->

        <!--&lt;!&ndash; Publishing sliders: Page Builders &ndash;&gt;-->
        <!--<article>-->
        <!--<h1 data-target="publish-page-builders">Method 3: Page Builders, Visual Composer</h1>-->
        <!--<p>Most page builders in themes support embedding LayerSlider-->
        <!--sliders out of the box. Whether you're using a custom solution or a-->
        <!--popular plugin like Visual Composer, there is likely a way to use them-->
        <!--with LayerSlider.</p>-->
        <!--<p>Either there is a dedicated module/block/widget for LayerSlider,-->
        <!--or you can insert shortcodes in the same manner described in the first-->
        <!--method.</p>-->
        <!--<p>If you experience any issue, please review the available options-->
        <!--your page builder offers. Since each solution differs in design and-->
        <!--behavior, there is no universal guide to them. You can also consider-->
        <!--just using more conventional methods like shortcodes and widgets-->
        <!--described in method 1 and 2 respectively.</p>-->
        <!--<figure>-->
        <!--<div class="img-holder" style="padding-bottom: 53.7275%;">-->
        <!--<img src="<?= $asset_dir.'/img' ?>/illustration-visual-composer2x.png" width="1556" height="836">-->
        <!--</div>-->
        <!--<figcaption class="zigzag">Inserting a slider with Visual Composer.</figcaption>-->
        <!--</figure>-->
        <!--</article>-->


        <!--&lt;!&ndash; Publishing sliders: With PHP function &ndash;&gt;-->
        <!--<article data-target="publish-php">-->
        <!--<h1>Method 4: PHP function</h1>-->
        <!--<p>Because a slider can be an integral part of your site, you may-->
        <!--want to insert it dynamically from the template files. There is a PHP-->
        <!--function (with additional filtering options) to do just that. For-->
        <!--example, you can call it from the header.php file of your theme and it-->
        <!--will insert your slider into the corresponding area. By providing-->
        <!--filters you can show it on certain pages only depending on your-->
        <!--settings. Here is the function definition:</p>-->
        <!--<div>-->
        <!--<code>layerslider ( mixed $sliderID [, string $filters] )</code><br>-->
        <!--<ul>-->
        <!--<li>The <code>$sliderID</code> parameter can be found in the list of your sliders on the LayerSlider admin area. See the first table column.</li>-->
        <!--<li><code>$filters</code> is an optional filter list. Read the <a href="#publish-filters">Using filters</a> section to learn more.</li>-->
        <!--</ul>-->
        <!--</div>-->
        <!--<p>The following examples are all valid:</p>-->
        <!--<div><div id="highlighter_325168" class="syntaxhighlighter  php"><table cellspacing="0" cellpadding="0" border="0"><tbody><tr><td class="gutter"><div class="line number1 index0 alt2">1</div><div class="line number2 index1 alt1">2</div><div class="line number3 index2 alt2">3</div><div class="line number4 index3 alt1">4</div><div class="line number5 index4 alt2">5</div><div class="line number6 index5 alt1">6</div></td><td class="code"><div class="container"><div class="line number1 index0 alt2"><code class="php plain">&lt;?php layerslider(1); ?&gt; </code><code class="php comments">// Displays the first slider on every page</code></div><div class="line number2 index1 alt1"><code class="php plain">&lt;?php layerslider(1, </code><code class="php string">'homepage'</code><code class="php plain">); ?&gt; </code><code class="php comments">// Displays the first slider only on your home page</code></div><div class="line number3 index2 alt2"><code class="php plain">&lt;?php layerslider(1, </code><code class="php string">'my-custom-post-title'</code><code class="php plain">); ?&gt; </code><code class="php comments">// Displays the first slider on a custom page by name</code></div><div class="line number4 index3 alt1"><code class="php plain">&lt;?php layerslider(2, </code><code class="php string">'1369'</code><code class="php plain">); ?&gt; </code><code class="php comments">// Displays the second slider on a custom page by ID</code></div><div class="line number5 index4 alt2"><code class="php plain">&lt;?php layerslider(</code><code class="php string">'homefullwidth'</code><code class="php plain">, </code><code class="php string">'category-name'</code><code class="php plain">); ?&gt; </code><code class="php comments">// Displays the slider with the slug 'homefullwidth' on ali/custom page by a category name</code></div><div class="line number6 index5 alt1"><code class="php plain">&lt;?php layerslider(3, </code><code class="php string">'homepage,about-us,1234'</code><code class="php plain">); ?&gt; </code><code class="php comments">// Displays the third slider on multiple pages</code></div></div></td></tr></tbody></table></div></div>-->
        <!--<p>It is important to check the corresponding slider ID on the-->
        <!--LayerSlider WP slider list page. When you remove some sliders, their IDs-->
        <!--won't be re-indexed and the sequence you would expect may broke up.-->
        <!--This is important for data consistency.</p>-->
        <!--</article>-->


        <!--&lt;!&ndash; Publishing sliders: Using filters &ndash;&gt;-->
        <!--<article data-target="publish-filters">-->
        <!--<h1>Using filters to display sliders on specific pages</h1>-->
        <!--<p>Filters can be used to target specific pages where you want a-->
        <!--slider to be displayed. This can be extremely helpful if you're-->
        <!--inserting sliders in a way that would show them on multiple pages. By-->
        <!--using filters you can set custom conditions that would otherwise require-->
        <!--programming skills. Our solution is easy to use for anyone and the-->
        <!--currently supported filters should cover most use cases.</p>-->
        <!--<ul class="nomargin">-->
        <!--<li><mark>Front Page:</mark> The special name <code>homepage</code> can be used to display the slider on your site's main page.</li>-->
        <!--<li><mark>Page ID:</mark> Use a page ID to display sliders on a-->
        <!--specific page. You can find the page ID in the URL (post=&lt;number&gt;)-->
        <!--when you're editing a page/post on the WP admin area.</li>-->
        <!--<li><mark>Page Slug:</mark> A page slug can also achieve the same-->
        <!--purpose as page IDs. The page slug is the editable part of the-->
        <!--permalink, which you can see when editing a page/post on the admin-->
        <!--interface.</li>-->
        <!--<li><mark>Category:</mark> You can also filter for category pages.-->
        <!--Providing a category name will display the slider on all pages-->
        <!--belonging to that category.</li>-->
        <!--</ul>-->

        <!--<p>-->
        <!--<strong>Important:</strong> You can set multiple filters. Just-->
        <!--provide a comma separated list if you want to display sliders on-->
        <!--multiple pages. Mixing the different kinds of filters together or-->
        <!--providing multiple IDs/slugs/category names is not a problem.-->
        <!--</p>-->
        <!--<p class="nomargin"><strong>Example:</strong> The filter list <code>homepage,about-us,1234</code> can be split into three different filters:</p>-->
        <!--<ul class="nomargin">-->
        <!--<li>homepage – your site's main/front page</li>-->
        <!--<li>about-us – a page slug (permalink)</li>-->
        <!--<li>1234 – a page ID if you don't use pretty URLs</li>-->
        <!--</ul>-->
        <!--</article>-->
        <!--</section>-->


        <!-- Publishing Popups -->
        <!--<section data-target="publishing-popups">-->
        <!--<nav>-->
        <!--<ul>-->
        <!--<li><a href="#popups-about">About Popups</a></li>-->
        <!--<li><a href="#popups-embed">Embedding Popups</a></li>-->
        <!--<li><a href="#popups-autoinclude">Using the auto include feature</a></li>-->
        <!--<li><a href="#popups-extras">Extras</a></li>-->
        <!--<li class="troubleshooting"><a href="#publish-troubleshooting">Troubleshooting</a></li>-->
        <!--</ul>-->
        <!--</nav>-->

        <!--<h1 data-target="popups">Publishing Popups</h1>-->

        <!--<h2 data-target="popups-about">About Popups</h2>-->
        <!--<p>LayerSlider is a well established product with many years of -->
        <!--experience behind it. Combining our strong foundation and the vast -->
        <!--number of features we already have with the newly introduced Popup -->
        <!--plugin makes LayerSlider one of the best choice among popup plugins. All-->
        <!--the features you would use in sliders are also available in Popups as -->
        <!--well. This includes our feature rich image &amp; content editor, -->
        <!--multilingual popups, dynamic content from WP posts, and of course -->
        <!--LayerSlider's animation capabilities.</p>-->

        <!--<p>In addition, the LayerSlider Popup plugin comes with a variety of-->
        <!--new options to fine tune the appearance and control when and how to -->
        <!--display popups. Greet new visitors on your site with a beautifully -->
        <!--designed animated banner with newsletter subscription or other offers. -->
        <!--Display a message when they become idle. Show them recommended content -->
        <!--before leaving the page or when they finished reading an article. There -->
        <!--are a lot of possibilities and all of LayerSlider's content creation and-->
        <!--animation capabilities are at your service to make popups that stand -->
        <!--out from the crowd.</p>-->

        <!--<p><a href="https://layerslider.kreaturamedia.com/features/popups/" target="_blank">Click here to more information and live examples</a></p>-->

        <!--<figure>-->
        <!--<div class="img-holder" style="padding-bottom: 61.0455%;">-->
        <!--<img src="<?= $asset_dir.'/img' ?>/illustration-popup-settings2x.png" width="2200" height="1343">-->
        <!--</div>-->
        <!--<figcaption class="zigzag">Illustration of the Popup settings.</figcaption>-->
        <!--</figure>-->


        <!--<h2 data-target="popups-embed">Embedding Popups</h2>-->
        <!--<p>Popups can be embedded to your pages in the same way as traditional sliders. Any of the method described in <a href="#publishing-sliders">Publishing Sliders</a>-->
        <!--will work. We're also providing a new method to fine tune how and when -->
        <!--to display a Popup. See the next section to learn how to use the auto -->
        <!--include feature.</p>-->


        <!--<h2 data-target="popups-autoinclude">Using the auto include feature</h2>-->
        <!--<p>Given the nature of Popups, you will likely want to include it on-->
        <!--multiple pages with fine tuning when and to whom it should appear. -->
        <!--Although conventional methods of including sliders will work the same, -->
        <!--you will probably want to use the auto include feature dedicated -->
        <!--specifically to Popups.</p>-->
        <!--<div class="km-notification warning cf">-->
        <!--<span class="dashicons dashicons-warning"></span>-->
        <!--The features described below will only with the auto-include -->
        <!--method. If you use other methods such as shortcodes, widgets, page -->
        <!--builders or PHP functions the Popup will always appear.-->
        <!--</div>-->
        <!--<ul>-->
        <!--<li>-->
        <!--<strong>Choose your target pages:</strong>-->
        <!--<span>In the Target Pages section you will be presented some -->
        <!--pre-defined option to choose on which pages a Popup should appear. By -->
        <!--turning the All pages switch off, more options will become available to -->
        <!--choose where to include your Popup. By entering a comma separated list -->
        <!--of page IDs, titles or slugs into the Include custom pages text field -->
        <!--you can add individual pages. There is also an option to exclude pages -->
        <!--in the same manner.</span>-->
        <!--</li>-->
        <!--<li>-->
        <!--<strong>Choose your target audience:</strong>-->
        <!--<span>Select the roles and user groups to whom you want to display-->
        <!--the Popup. You have the option to show your work only for registered or-->
        <!--unregistered users, or even to first time visitors for example.</span>-->
        <!--</li>-->
        <!--<li>-->
        <!--<strong>Set up a repeat:</strong>-->
        <!--<span>Disable the Repeat Popup option if you would like to show a -->
        <!--Popup only once to a vistor. Enable the Repeat Popup option and leave -->
        <!--the Repeat after # days option empty if you want to display the Popup on-->
        <!--each page load. Alternatively, you can enter a value from 0 to 365 to -->
        <!--repeat after the specified number of days has passed.</span>-->
        <!--</li>-->
        <!--<li>-->
        <!--<strong>Fine tune your work:</strong>-->
        <!--<span>Don't forget to check out the Launch Popup section to set up-->
        <!--triggers to control when the Popup should become visible. You can also -->
        <!--fine tune the appearance of other aspects of your Popup with the other -->
        <!--settings we didn't mention here.</span>-->
        <!--</li>-->
        <!--</ul>-->


        <!--<h2 data-target="popups-extras">Extras</h2>-->
        <!--<p>As mentioned in the <a href="#builder-layer-linking">Linking layers</a> sections, the <code>#closepopup</code>-->
        <!--Smart Link can be very helpful if you want to design your own close -->
        <!--button with unique appearance and transitions. This option also -->
        <!--available when linking the entire surface of slides.</p>-->
        <!--<p>Alternatively, you can apply the <code>ls-close-popup-button</code> class name to any element within the slider to achieve the same goal.</p>-->
        <!--<p>If you have multiple Popups on the same page, you might want a -->
        <!--single button to close them all. In a case like that just apply the <code>ls-close-all-popups-button</code> class name on any element on the page.</p>-->


        <!--<h2 data-target="publish-troubleshooting">Troubleshooting</h2>-->
        <!--<ul>-->
        <!--<li>-->
        <!--<strong>My Popup doesn't show up:</strong>-->
        <!--<span>Review the Launch Popup section and verify that you've set a-->
        <!--trigger. Also check out the Repeat Control options. You might already -->
        <!--saw the Popup previously and there isn't a proper repeat set up. Make -->
        <!--sure that the Popup should be visible to you and on the page where you -->
        <!--test it based on the Target Pages &amp; Target Audience settings.<br><br>-->

        <!--Furthermore, see if you've selected the Popup option under Slider -->
        <!--Settings -&gt; Layout. Popup is a premium feature, it also requires -->
        <!--product activation if you haven't done it already.</span>-->
        <!--</li>-->
        <!--<li>-->
        <!--<strong>My Popup show up as a regular slider:</strong>-->
        <!--<span>Make sure that you've selected the Popup option under Slider-->
        <!--Settings -&gt; Layout. Without that, your work will appear as regular -->
        <!--sliders or not at all.</span>-->
        <!--</li>-->
        <!--<li>-->
        <!--<strong>Can I use the same slider both as a Popup and regular slider?</strong>-->
        <!--<span>No. Popups have different layout options that would make it -->
        <!--really impractical. However, you can duplicate the slider slider and use-->
        <!--slightly different settings if you are looking into a workaround.</span>-->
        <!--</li>-->
        <!--<li>-->
        <!--<strong>How can I use forms, email subscriptions, etc. in Popups?</strong>-->
        <!--<span>Currently, LayerSlider does not offer form building or email-->
        <!--subscription features. However, you can use 3rd party solutions for -->
        <!--these kind of purposes. LayerSlider is shortcode aware, just create an -->
        <!--HTML layer and paste the shortcode of any 3rd party plugin of your -->
        <!--choosing. This enables you to combine and use the best of both worlds -->
        <!--without compromising.</span>-->
        <!--</li>-->
        <!--<li>-->
        <!--<strong>Do you track impressions and other statistics?</strong>-->
        <!--<span>We're planning to introduce features like this in future -->
        <!--updates. Until then you can embed custom HTML and WordPress shortcodes, -->
        <!--so there shouldn't be an obstacle to use 3rd party solutions of your -->
        <!--choosing.</span>-->
        <!--</li>-->
        <!--</ul>-->
        <!--</section>-->


        <!-- Third-Party Integration Guides -->
        <section data-target="integration-guides">

            <nav>
                <ul>
                    <li><a href="#third-party-fancybox">FancyBox</a></li>
                    <li><a href="#third-party-more">Coming soon</a></li>
                </ul>
            </nav>

            <h1>Third-Party Integration Guides</h1>
            <h2 data-target="third-party-fancybox">Using FancyBox in sliders</h2>
            <p>FancyBox and other Lightbox-like plugins in general can be used
                to display almost any type of content in a modal window. Images,
                galleries, videos, other websites, pdfs, you name it. In our example
                we're demonstrating how to embed Google Maps, but you can use the same
                method to add other embeddable web services as well.</p>

            <h3>Setting up a Google Maps modal</h3>
            <ol class="nomargin">
                <li>First, you need to install a FancyBox WordPress plugin. In our guide we used <a
                            href="https://wordpress.org/plugins/easy-fancybox/" target="_blank">Easy FancyBox</a>.
                </li>
                <li>Make sure to review the Easy FancyBox plugin settings and enable to load videos and iframes.</li>
                <li>After setting up FancyBox, jump back to LayerSlider and select a layer in the editor that you want
                    to use with FancyBox.
                </li>
                <li>Under the Link &amp; Attributes tab, enter the URL you want to display with Fancybox, then enter the
                    <code>fancybox-iframe</code> into the <code>class</code> field in the custom attributes section.
                </li>
                <li>That's it, FancyBox should now appear when you click on the layer on your front-end pages.</li>
            </ol>
            <figure>
                <div class="img-holder" style="padding-bottom: 53.6111%;">
                    <img src="<?= $asset_dir.'/img' ?>/illustration-fancybox2x.png"
                         width="2160" height="1158">
                </div>
                <figcaption class="zigzag">Example of setting up a Google Maps modal with the Easy FancyBox plugin in a
                    LayerSlider slider
                </figcaption>
            </figure>

            <h3>Other use cases</h3>
            <p>Of course, FancyBox offers a lot more. You can also make image
                galleries or embed YouTube videos for example. All of these can be done
                by applying the appropriate class name and other special attributes
                described in the <a href="https://wordpress.org/plugins/easy-fancybox/faq/" target="_blank">Easy
                    Fancybox documentation</a>.</p>

            <p>For example, To group multiple layers into one gallery, enter the same <code>rel</code> name on all
                layers. It can be a custom identifier of your choosing. For example:
                <mark>flowers-gallery</mark>
                .
            </p>

            <h3>Troubleshooting</h3>
            <p>If you experience any issue, please verify that you've installed
                and activated the Easy FancyBox plugin, and you've reviewed all of its
                settings to allow the functionally you're seeking. For example, if you
                want to embed web contents, you need to allow
                <mark>iframes</mark>
                .
            </p>

            <h1>More guides are coming soon</h1>
            <p>Based on requests and popular demand, we will continue to include
                more and more integration guides to use LayerSlider with your
                favorites.</p>
        </section>


        <!-- Advanced Customization -->
        <!--<section data-target="advanced-customization">-->

        <!--<nav>-->
        <!--<ul>-->
        <!--<li><a href="#transition-builder">Transition Builder</a></li>-->
        <!--<li><a href="#skin-editor">Skin Editor</a></li>-->
        <!--<li><a href="#css-editor">CSS Editor</a></li>-->
        <!--<li>-->
        <!--<a href="#layerslider-api">LayerSlider API</a>-->
        <!--<ul>-->
        <!--<li><a href="#api-events">Event reference</a></li>-->
        <!--<li><a href="#api-event-data">Event Data object</a></li>-->
        <!--<li><a href="#api-methods">API methods</a></li>-->
        <!--<li><a href="#api-examples">Examples</a></li>-->
        <!--</ul>-->
        <!--</li>-->
        <!--<li><a href="#legacy-api">Legacy API</a></li>-->
        <!--</ul>-->
        <!--</nav>-->

        <!--&lt;!&ndash; Advanced Customization: Transition Builder &ndash;&gt;-->
        <!--<article>-->

        <!--<h1 data-target="transition-builder">Using the Transition Builder</h1>-->
        <!--<p>LayerSlider WP supports various types of slide transitions. The-->
        <!--Transition Builder offers you an easy-to-use visual editor to create-->
        <!--custom transitions for your own needs. Transitions created with the-->
        <!--editor will automatically appear in the list of available transitions-->
        <!--when you're editing a slider.</p>-->

        <!--<h3>Tips &amp; tricks</h3>-->
        <!--<p>We can recommend the same tips as we mentioned in the Slider Builder section:</p>-->
        <!--<ul class="nomargin">-->
        <!--<li>Hover over an option field with your mouse cursor to reveal more information.</li>-->
        <!--<li>Watch the preview. The best way to learn is to instantly see-->
        <!--how each option affect the transition you're building. Just play with-->
        <!--the settings and observe the differences to understand their role.</li>-->
        <!--<li>We have sample transitions, too! They should be already added-->
        <!--to the Transition Builder when you first visit the page. You can see the-->
        <!--settings we've used to build these samples. You can also import any of-->
        <!--the 200+ pre-defined 2D/3D transitions we're using in the plugin.</li>-->
        <!--</ul>-->

        <!--<h3>Building 3D transitions</h3>-->
        <!--<p>3D transitions are made up with 3 animation steps to create more-->
        <!--complex transitions with multiple actions. The "animation" step is-->
        <!--required, but the "before animation" and "after animation" steps are-->
        <!--optional. You can use them to do some preparation before the animation-->
        <!--starts or restore back some settings after it is finished.</p>-->

        <!--<p>To help you better understand what are these steps, here is a simple example:</p>-->
        <!--<ul class="nomargin">-->
        <!--<li>Before the animation starts, you may want to scale down columns</li>-->
        <!--<li>Then rotate them to left</li>-->
        <!--<li>Finally, you want them to scale up back</li>-->
        <!--</ul>-->


        <!--<p>If you want a really simple transition, you don't have to use-->
        <!--all the steps. In this case, please make sure to untick the "Enabled"-->
        <!--checkboxes for the corresponding steps.</p>-->
        <!--</article>-->

        <!--&lt;!&ndash; Advanced Customization: Skin Editor &ndash;&gt;-->
        <!--<article>-->
        <!--<h1 data-target="skin-editor">About LayerSlider WP Skin Editor</h1>-->

        <!--<p>The LayerSlider WP skin editor offers you a graphical way on-->
        <!--your WP admin area to modify LayerSlider skins without the need to work-->
        <!--with files on FTP. The Skin Editor automatically detects additional-->
        <!--content, so you can customize skins from other sources as well.</p>-->

        <!--<div class="km-notification info cf">-->
        <!--<span class="dashicons dashicons-info"></span>-->
        <!--Editing a skin requires some basic CSS knowledge, please do not-->
        <!--attempt to modify a skin if you aren't familiar with CSS. Malformed or-->
        <!--invalid CSS code can break your slider appearance.-->
        <!--</div>-->

        <!--<div class="km-notification warning">-->
        <!--<span class="dashicons dashicons-warning"></span>-->
        <!--Please note, updating the plugin (including auto-updates) will-->
        <!--override the plugin folder along with your modifications. Consider using-->
        <!--the <a href="#css-editor">CSS Editor</a> or back-up your modifications before updating.-->
        <!--</div>-->
        <!--</article>-->

        <!--&lt;!&ndash; Advanced Customization: CSS Editor &ndash;&gt;-->
        <!--<article>-->
        <!--<h1 data-target="css-editor">About LayerSlider WP CSS Editor</h1>-->

        <!--<p>With this editor, you can enter custom CSS code, which will be-->
        <!--included on pages containing LayerSlider sliders. This gives you a-->
        <!--chance for much more complex customizations that the Slider Builder-->
        <!--interface cannot provide. Your CSS code will also be included in the-->
        <!--Slider Builder, thus the Preview mode should pick them up and show the-->
        <!--appropriate result on-the-fly.</p>-->

        <!--<div class="km-notification info cf">-->
        <!--<span class="dashicons dashicons-info"></span>-->
        <!--Using CSS requires some web development experience. Please do not-->
        <!--attempt to use this editor if you're not familiar with CSS. Malformed or-->
        <!--invalid CSS code can break the appearance of sliders or your site.-->
        <!--</div>-->
        <!--</article>-->


        <!--&lt;!&ndash; Advanced Customization: LayerSlider API &ndash;&gt;-->
        <!--<article>-->

        <!--<h1 data-target="layerslider-api">About LayerSlider API</h1>-->
        <!--<p>LayerSlider is built on standard web technologies like HTML,-->
        <!--CSS, and Javascript, and offers a way to extend the capabilities of the-->
        <!--plugin through the LayerSlider API. Please note, this requires-->
        <!--programming skills and web development experience, thus we cannot-->
        <!--recommend it to users without the necessary knowledge.</p>-->

        <!--<div class="km-notification info cf">-->
        <!--<span class="dashicons dashicons-info"></span>-->
        <!--LayerSlider 6 introduced a whole new API model with new events and-->
        <!--methods. To view the API documentation for older releases, please-->
        <!--navigate to the <a href="#legacy-api">Legacy API</a> section. The legacy API cannot be used in LayerSlider 6, it is documented only to provide you a way of porting (if needed).-->
        <!--</div>-->

        <!--<h2 data-target="api-events">Event reference</h2>-->
        <!--<p>Event callbacks is a way to receive notifications and run custom-->
        <!--code when certain actions occur in sliders. The following events can be-->
        <!--used under the <code>Event Callbacks</code> tab of the Slider Builder.</p>-->
        <!--<div class="table">-->
        <!--<table class="fr-200">-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Init Events</th>-->
        <!--<th>Description</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>sliderWillLoad</td>-->
        <!--<td>Fires as soon as a LayerSlider instance has been created,-->
        <!--but before processing any user data or rendering the UI. This gives you a-->
        <!--chance to perform any task before LayerSlider tries to parse the markup-->
        <!--and user settings. Since this event occurs in mid-initialization, you-->
        <!--must bind this event on the target element before calling-->
        <!--.layerSlider().</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>sliderDidLoad</td>-->
        <!--<td>Fires when a LayerSlider instance is fully initialized and-->
        <!--its UI elements become accessible for DOM manipulation. You should bind-->
        <!--this event on the target element before calling .layerSlider() to avoid-->
        <!--timing issues.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Resize Events</th>-->
        <!--<th>Description</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>sliderWillResize</td>-->
        <!--<td>Fires before resizing and rendering sliders due to a-->
        <!--viewport/orientation etc. change. Keep in mind that running slow code in-->
        <!--this event can lead to performance issues, as it is called subsequently-->
        <!--in multiple times.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>sliderDidResize</td>-->
        <!--<td>Fires after sliders have been resized and rendered due to a-->
        <!--viewport/orientation etc. change. Keep in mind that running slow code-->
        <!--in this event can lead to performance issues, as it is called-->
        <!--subsequently in multiple times.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Slideshow Events</th>-->
        <!--<th>Description</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slideshowStateDidChange</td>-->
        <!--<td>A changed slideshow state can occur for various reasons,-->
        <!--such as starting media playback, hovering over the slider, manually-->
        <!--pausing the slideshow, etc. This event fires at any state change. Since-->
        <!--there are multiple states, it's not guaranteed that there is an actual-->
        <!--change in playing/pausing the slideshow. Slideshow states can be-->
        <!--retrieved from the Event Data object passed to the callback handler.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slideshowDidResume</td>-->
        <!--<td>This event fires when the slideshow resumes from a paused-->
        <!--state. Please note that slide timers and layer transitions are not bound-->
        <!--to the slideshow directly. Depending on the <code>pauseLayers</code>-->
        <!--option, the slide's animation timeline can continue its progress towards-->
        <!--the end of the slide and wait for slide change until the slideshow-->
        <!--resumes from its paused state. You can examine the passed Event Data-->
        <!--object to identify which settings is applied.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slideshowDidPause</td>-->
        <!--<td>Fires when the slideshow pauses from a playing state. As mentioned in the previous event, the <code>pauseLayers</code>-->
        <!--option decides which (if any) animations can continue playing in the-->
        <!--background. The slideshow paused state only guarantees the prevention of-->
        <!--changing slides. You can examine the passed Event Data object to-->
        <!--identify which settings is applied.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Slide Change Events</th>-->
        <!--<th>Description</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slideChangeWillStart</td>-->
        <!--<td>This event signals whenever the slider wants to change-->
        <!--slides, and is your last chance to divert or intervene in any way. The-->
        <!--proposed slide indexes and other relevant information is in the passed-->
        <!--Event Data object.-->
        <!--<br><br>-->
        <!--<i>Return false to prevent slide change, or return an integer to switch to that slide instead of the proposed one.</i></td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slideChangeDidStart</td>-->
        <!--<td>This is the last notification before the slider commences a-->
        <!--slide change. At this point you can no longer divert or intervene, its-->
        <!--only purpose is letting you know the next slide index and other relevant-->
        <!--data in advance.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slideChangeWillComplete</td>-->
        <!--<td>Fires before completing the slide change. Since at this-->
        <!--point the slide change is still in progress, the current slide's index-->
        <!--is still pointing to the previous slide. Please note, layers animation-->
        <!--may occur earlier in execution depending on the <code>timeShift</code> option. See the Slide Timeline Events section if you're looking for an event like that.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slideChangeDidComplete</td>-->
        <!--<td>Fires after a slide change has completed and the slide-->
        <!--indexes have been updated. Please note, layers animation may occur-->
        <!--earlier in execution depending on the <code>timeShift</code> option. See the Slide Timeline Events section if you're looking for an event like that.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Slide Timeline Events</th>-->
        <!--<th>Description</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slideTimelineDidCreate</td>-->
        <!--<td>Fires when the current slide's animation timeline (e.g-->
        <!--layer transitions on the slide) has been created. This event lets you-->
        <!--know when the GSAP timeline object becomes accessible for interfacing.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slideTimelineDidUpdate</td>-->
        <!--<td>Fires rapidly (at each frame) throughout the entire slide-->
        <!--while the animation timeline (e.g. your layers on the slide) is playing.-->
        <!--This includes reverse playback as well.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slideTimelineDidStart</td>-->
        <!--<td>Fires when the current slide's animation timeline (e.g.-->
        <!--your layers) has started. This event signals the exact time in execution-->
        <!--when the first (earlier) layer becomes visible and transitions are-->
        <!--taking place.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slideTimelineDidComplete</td>-->
        <!--<td>Fires when the current slide's animation timeline has-->
        <!--completed (e.g. layer transitions) and the slider is ready to change-->
        <!--slides. However, changing slides is not yet guaranteed at this point, as-->
        <!--it depends on slideshow states and other factors. <br><br>This event-->
        <!--only concerns transitions occurring on the slide, thus it is possible to-->
        <!--divert the slider or intervene in any way before changing slides. The-->
        <!--proposed slide indexes and other relevant information is in the passed-->
        <!--Event Data object.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slideTimelineDidReverseComplete</td>-->
        <!--<td>Fires when all animations on a reversed slide have reached-->
        <!--their starting point and the slide is ready to be played from the-->
        <!--beginning.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Popup Events</th>-->
        <!--<th>Description</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>popupWillOpen</td>-->
        <!--<td>Fires when the Popup starts its opening transition and becomes visible.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>popupDidOpen</td>-->
        <!--<td>Fires when the Popup completed its opening transition.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>popupWillClose</td>-->
        <!--<td>Fires when the Popup stars its closing transition.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>popupDidClose</td>-->
        <!--<td>Fires when the Popup completed its closing transition and became hidden.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Destroy Events</th>-->
        <!--<th>Description</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>sliderDidDestroy</td>-->
        <!--<td>Due to technical reasons, destroying a slider may not-->
        <!--happen instantaneously. This event lets you know when the slider-->
        <!--destructor has finished and it is safe to remove the slider from DOM-->
        <!--after calling the <code>destroy</code> API method.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>sliderDidRemove</td>-->
        <!--<td>This event is fired as the last step when destroying a slider and the second parameter <code>true</code> was passed in the <code>destroy</code> API method indicating to remove the slider.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<h2 data-target="api-event-data">Event Data object</h2>-->
        <!--<p>Most event handler functions will have the same 2 pre-defined-->
        <!--variables passed. Those are the jQuery Event object and our custom-->
        <!--slider data object. You can name these variables by your choice, but we-->
        <!--will refer to them as <code>event</code> and <code>slider</code> in our examples.</p>-->

        <!--<p>Every <code>slider</code> data object will  contain the same-->
        <!--properties, regardless of the used event. However, it's possible that-->
        <!--some values are not yet set depending on the current point of execution.-->
        <!--The data object contains the most relevant information, but we've also-->
        <!--included the entire LayerSlider instance data source, which you can use-->
        <!--to access or modify properties on the fly, as well as to add new methods-->
        <!--to implement new features.</p>-->

        <!--<p>We encourage everyone to use the browser developer tools and-->
        <!--examine the returned data by using console.log() to see potentially-->
        <!--undocumented data. Here is an example that you can paste into your-->
        <!--browser's JavaScript console. Please make sure to use the right-->
        <!--selection when targeting the slider container element on which the-->
        <!--LayerSlider instance was created.</p>-->

        <!--<div><div id="highlighter_844563" class="syntaxhighlighter  js"><table cellspacing="0" cellpadding="0" border="0"><tbody><tr><td class="gutter"><div class="line number1 index0 alt2">1</div><div class="line number2 index1 alt1">2</div></td><td class="code"><div class="container"><div class="line number1 index0 alt2"><code class="js keyword">var</code> <code class="js plain">data = jQuery(</code><code class="js string">'#slider'</code><code class="js plain">).layerSlider(</code><code class="js string">'eventData'</code><code class="js plain">);</code></div><div class="line number2 index1 alt1"><code class="js plain">console.log( data );</code></div></div></td></tr></tbody></table></div></div><br><br>-->

        <!--<div class="km-notification info">-->
        <!--<span class="dashicons dashicons-info"></span>-->
        <!--Please note, the <code>slider.</code> prefix in every property name refers to the passed variable to callback functions, which can be named differently.-->
        <!--</div>-->

        <!--<div class="table">-->
        <!--<table>-->
        <!--<thead>-->
        <!--<tr><th>Slider Properties</th>-->
        <!--<th>Type</th>-->
        <!--<th>Value</th>-->
        <!--</tr></thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slider.data</td>-->
        <!--<td>Object</td>-->
        <!--<td>The complete data source object of the current LayerSlider-->
        <!--instance. Since this is a reference, you can access and modify any part-->
        <!--of the object. You can event add new methods to implement new features-->
        <!--this way.</td>-->
        <!--</tr>-->

        <!--<tr>-->
        <!--<td>slider.userData</td>-->
        <!--<td>Object</td>-->
        <!--<td>The parsed (e.g. defaults included) slider options which have been set by the user in the init code.</td>-->
        <!--</tr>-->

        <!--<tr>-->
        <!--<td>slider.target</td>-->
        <!--<td>DOMNode</td>-->
        <!--<td>The slider container element, on which LayerSlider was initialized.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.state</td>-->
        <!--<td>Object</td>-->
        <!--<td>The slider states object, which indicates whether the slider is preloading images, changing  or animating slides etc.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.isBusy</td>-->
        <!--<td>Boolean</td>-->
        <!--<td>Returns a boolean value indicating whether the slider is busy to complete background tasks (see <code>slider.state</code>).</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.api()</td>-->
        <!--<td>Function</td>-->
        <!--<td>The shortcut to execute API commands. Example: slider.api('next');</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr><th>First (Starting) Slide Properties</th>-->
        <!--<th>Type</th>-->
        <!--<th>Value</th>-->
        <!--</tr></thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slider.slides.first.index</td>-->
        <!--<td>Integer</td>-->
        <!--<td>The index of the first (starting) slide. The count starts from 1 instead of zero.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slides.first.deeplink</td>-->
        <!--<td>String</td>-->
        <!--<td>Deeplink of the first (starting) slide (if any).</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr><th>Previous Slide Properties</th>-->
        <!--<th>Type</th>-->
        <!--<th>Value</th>-->
        <!--</tr></thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slider.slides.prev.index</td>-->
        <!--<td>Integer</td>-->
        <!--<td>The index of the previous slide. The count starts from 1 instead of zero. Please note, this value is updated after the <code>slideChangeDidComplete</code> event.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slides.prev.deeplink</td>-->
        <!--<td>String</td>-->
        <!--<td>Deeplink of the previous slide (if any).</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr><th>Current Slide Properties</th>-->
        <!--<th>Type</th>-->
        <!--<th>Value</th>-->
        <!--</tr></thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slider.slides.current.index</td>-->
        <!--<td>Integer</td>-->
        <!--<td>The index of the current slide. The count starts from 1 instead of zero. Please note, this value is updated after the <code>slideChangeDidComplete</code> event.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slides.current.deeplink</td>-->
        <!--<td>String</td>-->
        <!--<td>Deeplink of the current slide (if any).</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slides.current.layersIn</td>-->
        <!--<td>jQery Collection</td>-->
        <!--<td>A jQuery collection of DOM nodes, which contains layers  appearing on the current slide, including static layers.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slides.current.layersOut</td>-->
        <!--<td>jQuery Collection</td>-->
        <!--<td>A jQuery collection of DOM nodes, which contains layers-->
        <!--leaving on the current slide. This includes static layers, since they-->
        <!--aren't bound to their origin slide.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slides.current.timeline</td>-->
        <!--<td>GSAP TimelineMax</td>-->
        <!--<td>The current slide's animation timeline, which you use to-->
        <!--easily manipulate animations. Slow them down, repeat them, reverse them.-->
        <!--You can do GreenSock functions to easily achieve surprising effects.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr><th>Next Slide Properties</th>-->
        <!--<th>Type</th>-->
        <!--<th>Value</th>-->
        <!--</tr></thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slider.slides.next.index</td>-->
        <!--<td>Integer</td>-->
        <!--<td>The index of the proposed next slide. The count starts from-->
        <!--1 instead of zero. The next slide can change at any time by a user-->
        <!--action or API commands.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slides.next.deeplink</td>-->
        <!--<td>String</td>-->
        <!--<td>Deeplink of the next slide (if any).</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slides.next.layersIn</td>-->
        <!--<td>jQuery Collection</td>-->
        <!--<td>The same as <code>slider.slides.current.layersIn</code> for the proposed next slide. The next slide can change at any time by user action or via API commands.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slides.next.layersOut</td>-->
        <!--<td>jQuery Collection</td>-->
        <!--<td>The same as <code>slider.slides.current.layersOut</code> for the proposed next slide. The next slide can change at any time by user action or via API commands.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr><th>Miscellaneous Slide Properties</th>-->
        <!--<th>Type</th>-->
        <!--<th>Value</th>-->
        <!--</tr></thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slider.slides.count</td>-->
        <!--<td>Integer</td>-->
        <!--<td>The number of slides in a slider.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slideChangeTimeline</td>-->
        <!--<td>GSAP TimelineMax</td>-->
        <!--<td>The slide transition animation timeline, which is used when-->
        <!--changing slides. You can use GreenSock functions to easily manipulate-->
        <!--the transition.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr><th>Slideshow Properties</th>-->
        <!--<th>Type</th>-->
        <!--<th>Value</th>-->
        <!--</tr></thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slider.slideshow.state</td>-->
        <!--<td>Object</td>-->
        <!--<td>An object of slideshow states, which determines whether the-->
        <!--slider is paused or not. There are several states such as media-->
        <!--playback, hovering over the slider, manually pausing the slideshow, etc.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slideshow.sequence</td>-->
        <!--<td>Array</td>-->
        <!--<td>An array containing slide indexes, which indicated the-->
        <!--pre-determined order of slides. This takes into account of random-->
        <!--slideshows, and provides a reliable value without user action.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slideshow.direction</td>-->
        <!--<td>String</td>-->
        <!--<td>'prev' or 'next' indicating whether the slideshow is playing forwards of backward depending on the <code>twoWaySlideshow</code> option.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.slideshow.isPaused</td>-->
        <!--<td>Boolean</td>-->
        <!--<td>Boolean indicating if the slideshow is paused at the time of execution. Depending on the <code>pauseLayers</code>-->
        <!--setting, the slide animation timeline may still continue its progress-->
        <!--towards the end of the slide. This means that layer transitions and-->
        <!--progress timers may not be interrupted, but the slider will not commence-->
        <!--to the next slide until resuming the slideshow.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--<thead>-->
        <!--<tr><th>Cycles Properties</th>-->
        <!--<th>Type</th>-->
        <!--<th>Value</th>-->
        <!--</tr></thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>slider.cycles.max</td>-->
        <!--<td>Integer</td>-->
        <!--<td>The number of cycles that the user set.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>slider.cycles.current</td>-->
        <!--<td>Integer</td>-->
        <!--<td>The number of cycles that the slider has performed at the time of execution.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->


        <!--<h2 data-target="api-methods">API methods</h2>-->
        <!--<p>The below API methods can be used to control sliders externally,-->
        <!--modify their behavior, or wire them up with 3rd party solutions. By-->
        <!--using the right combinations of API events and commands, you can-->
        <!--implement new features or extended the capabilities of the plugin with-->
        <!--custom code. Please note, API events are exposed to the API commands  in-->
        <!--the same way as anything else. Be aware that most API methods will-->
        <!--trigger the appropriate API events as well.</p>-->
        <!--<div class="table api-methods">-->
        <!--<table>-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Method name</th>-->
        <!--<th>Description</th>-->
        <!--<th>Example</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>(integer)</td>-->
        <!--<td>Initiate a slide change to the specified slide number. The-->
        <!--count starts from 1. The example on the right side shows how to switch-->
        <!--to the third slide.</td>-->
        <!--<td>$('#slider').layerSlider(3);</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--nextSlide <i>or</i><br>-->
        <!--next-->
        <!--</td>-->
        <!--<td>Skips to the next slide in the sequence.</td>-->
        <!--<td>$('#slider').layerSlider('next');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--previousSlide <i>or</i><br>-->
        <!--prev-->
        <!--</td>-->
        <!--<td>Changes to the previous slide.</td>-->
        <!--<td>$('#slider').layerSlider('prev');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--replaySlide <i>or</i><br>-->
        <!--replay-->
        <!--</td>-->
        <!--<td>Restarts the slide, replays all layer transitions from the beginning.</td>-->
        <!--<td>$('#slider').layerSlider('replay');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--reverseSlide <i>or</i><br>-->
        <!--reverse-->
        <!--</td>-->
        <!--<td>Play the slide and all transitions backwards, then pause at the beginning of the slide. Pass <code>true</code> as a second parameter to continue replaying the slider normally afterward.</td>-->
        <!--<td>$('#slider').layerSlider('reverse', true);</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>resetSlide</td>-->
        <!--<td>Immediately sets the current slide back to its starting state and pauses it.</td>-->
        <!--<td>$('#slider').layerSlider('resetSlide');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--stopSlideshow <i>or</i><br>-->
        <!--stop-->
        <!--</td>-->
        <!--<td>Stops the slideshow. Depending on the <code>pauseLayers</code>-->
        <!--setting, the slide animation timeline may still continue its progress-->
        <!--towards the end of slide. This means that layer transitions and progress-->
        <!--timers may not be interrupted, but the slider will not commence to the-->
        <!--next slide until resuming the slideshow.</td>-->
        <!--<td>$('#slider').layerSlider('stop');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--startSlideshow <i>or</i><br>-->
        <!--start-->
        <!--</td>-->
        <!--<td>Resumes the slideshow and re-enables the slider to change-->
        <!--slides when reaching the end of animation timeline. Since transitions-->
        <!--may occur even in a paused state depending on the <code>pauseLayers</code> setting, it possible that the timeline has already reached its end point when calling this command.</td>-->
        <!--<td>$('#slider').layerSlider('start');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--pauseSlider <i>or</i><br>-->
        <!--pause-->
        <!--</td>-->
        <!--<td>Stops the slider by freezing every animation taking place-->
        <!--at the time of execution, including slide transitions when changing-->
        <!--slides.</td>-->
        <!--<td>$('#slider').layerSlider('pause');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--resumeSlider <i>or</i><br>-->
        <!--resume-->
        <!--</td>-->
        <!--<td>Resumes the slider and continues playing frozen animations.</td>-->
        <!--<td>$('#slider').layerSlider('resume');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--toggleSlider <i>or</i><br>-->
        <!--toggle-->
        <!--</td>-->
        <!--<td>Toggles between <code>pauseSlider</code> and <code>resumeSlider</code> by respecting the current state.</td>-->
        <!--<td>$('#slider').layerSlider('toggle');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>openPopup</td>-->
        <!--<td>Opens initialized Popups waiting in the background to be launched.</td>-->
        <!--<td>$('#slider').layerSlider('openPopup');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>closePopup</td>-->
        <!--<td>Closes the Popup.</td>-->
        <!--<td>$('#slider').layerSlider('closePopup');</td>-->
        <!--</tr>-->

        <!--<tr>-->
        <!--<td>data</td>-->
        <!--<td>Returns the entire data object that the slider uses.</td>-->
        <!--<td>var data = $('#slider').layerSlider('data');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>eventData</td>-->
        <!--<td>Returns the Event Data object filled with the relevant values at the time of execution.</td>-->
        <!--<td>var data = $('#slider').layerSlider('eventData');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>userInitOptions</td>-->
        <!--<td>Returns the slider options provided by the user in the init code.</td>-->
        <!--<td>var data = $('#slider').layerSlider('userInitOptions');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>defaultInitOptions</td>-->
        <!--<td>Returns the full list of the default slider options.</td>-->
        <!--<td>var data = $('#slider').layerSlider('defaultInitOptions');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>sliderInitOptions</td>-->
        <!--<td>Returns the parsed slider options (extended by user data) used to initialize the slider.</td>-->
        <!--<td>var data = $('#slider').layerSlider('sliderInitOptions');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>originalMarkup</td>-->
        <!--<td>Returns the original HTML markup that the slider was initialized on.</td>-->
        <!--<td>var data = $('#slider').layerSlider('originalMarkup');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--redrawSlider <i>or</i><br>-->
        <!--redraw-->
        <!--</td>-->
        <!--<td>Recalculates the slider styles and repaints the slider.-->
        <!--Useful when you want to manually trigger responsive calculations to-->
        <!--update the slider UI.</td>-->
        <!--<td>$('#slider').layerSlider('redraw');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>-->
        <!--destroy <i>or</i><br>-->
        <!--kill-->
        <!--</td>-->
        <!--<td>Destroys the LayerSlider instance by canceling timers, removing events, freeing up allocated memory. Passing a second parameter <code>true</code> will also remove the slider element from the DOM.-->
        <!--<br><br>-->
        <!--<i>Due to technical reasons, destroying a slider may not happen instantaneously. See the <code>sliderDidDestroy</code> and <code>sliderDidRemove</code> events for more information.</i>-->
        <!--</td>-->
        <!--<td>$('#slider').layerSlider('destroy', true);</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->


        <!--<h2 data-target="api-examples">Examples</h2>-->
        <!--<ul>-->
        <!--<li>-->
        <!--<p>Switch slides with custom controls:</p>-->
        <!--<div><div id="highlighter_184691" class="syntaxhighlighter  xml"><table cellspacing="0" cellpadding="0" border="0"><tbody><tr><td class="gutter"><div class="line number1 index0 alt2">1</div></td><td class="code"><div class="container"><div class="line number1 index0 alt2"><code class="xml plain">&lt;</code><code class="xml keyword">a</code> <code class="xml color1">href</code><code class="xml plain">=</code><code class="xml string">"javascript:void(0);"</code> <code class="xml color1">onclick</code><code class="xml plain">=</code><code class="xml string">"$('#slider').layerSlider(2);"</code><code class="xml plain">&gt;Change to slide 2&lt;/</code><code class="xml keyword">a</code><code class="xml plain">&gt;</code></div></div></td></tr></tbody></table></div></div>-->
        <!--</li>-->
        <!--<li>-->
        <!--<p>Combining callbacks and API methods:</p>-->
        <!--<p>The following example will bring up an alert message after-->
        <!--every slide change with the current slide number. It can be used with-->
        <!--the <code>slideChangeDidComplete</code> event callback.</p>-->
        <!--<div><div id="highlighter_936615" class="syntaxhighlighter  js"><table cellspacing="0" cellpadding="0" border="0"><tbody><tr><td class="gutter"><div class="line number1 index0 alt2">1</div><div class="line number2 index1 alt1">2</div><div class="line number3 index2 alt2">3</div></td><td class="code"><div class="container"><div class="line number1 index0 alt2"><code class="js keyword">function</code><code class="js plain">(event, slider) {</code></div><div class="line number2 index1 alt1"><code class="js spaces">&nbsp;&nbsp;&nbsp;&nbsp;</code><code class="js plain">alert(</code><code class="js string">'The current slide is: '</code> <code class="js plain">+ slider.slides.current.index);</code></div><div class="line number3 index2 alt2"><code class="js plain">}</code></div></div></td></tr></tbody></table></div></div>-->
        <!--</li>-->
        <!--</ul>-->
        <!--</article>-->


        <!--&lt;!&ndash; Advanced Customization: Legacy API &ndash;&gt;-->
        <!--<article>-->
        <!--<h1 data-target="legacy-api">Legacy API - OBSOLETE, DO NOT USE</h1>-->
        <!--<div class="km-notification warning cf">-->
        <!--<span class="dashicons dashicons-warning"></span>-->
        <!--This version of the API was used in LayerSlider 5 and earlier-->
        <!--versions. It is no longer supported, DO NOT use it for current/future-->
        <!--project. We're keeping this in the documentation in order to provide you-->
        <!--a way of porting to the new API if needed.-->
        <!--</div>-->

        <!--<h4>Event reference</h4>-->
        <!--<div class="table">-->
        <!--<table>-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Event</th>-->
        <!--<th>Description</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>cbInit</td>-->
        <!--<td>Fires when LayerSlider has loaded.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>cbStart</td>-->
        <!--<td>Calling when the slideshow has started.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>cbStop</td>-->
        <!--<td>Calling when the slideshow is stopped by the user.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>cbPause</td>-->
        <!--<td>Firing when the slideshow is temporary on hold (e.g.: "Pause on hover" feature).</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>cbAnimStart</td>-->
        <!--<td>Calling when the slider commencing a slide change (animation start).</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>cbAnimStop</td>-->
        <!--<td>Firing when the slider finished a slide change (animation end).</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>cbPrev</td>-->
        <!--<td>Calling when the slider will change to the previous slide by the user.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>cbNext</td>-->
        <!--<td>Calling when the slider will change to the next slide by the user.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<h4>Slider data</h4>-->
        <!--<div class="table">-->
        <!--<table>-->
        <!--<thead>-->
        <!--<tr><th>Property</th>-->
        <!--<th>Value</th>-->
        <!--</tr></thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>data['prevLayerIndex']</td>-->
        <!--<td>Returns the index of the previous slide</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>data['curLayer']</td>-->
        <!--<td>Returns the jQuery object of the current slide </td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>data['curLayerIndex']</td>-->
        <!--<td>Returns the index of the current slide </td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>data['nextLayer']</td>-->
        <!--<td>Returns the jQuery object of the next slide</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>data['nextLayerIndex']</td>-->
        <!--<td>Returns the index of the next slide</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>data['layersNum']</td>-->
        <!--<td>Returns the number of slides in the slider</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>data['isAnimating']</td>-->
        <!--<td>Returns true if the slider is animating at the time of execution</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<p>To list all properties in the data object just paste this code-->
        <!--snippet into a callback function and check your browser's Javascript-->
        <!--console:</p>-->
        <!--<div><div id="highlighter_616485" class="syntaxhighlighter  js"><table cellspacing="0" cellpadding="0" border="0"><tbody><tr><td class="gutter"><div class="line number1 index0 alt2">1</div><div class="line number2 index1 alt1">2</div><div class="line number3 index2 alt2">3</div></td><td class="code"><div class="container"><div class="line number1 index0 alt2"><code class="js keyword">for</code><code class="js plain">(key </code><code class="js keyword">in</code> <code class="js plain">data) {</code></div><div class="line number2 index1 alt1"><code class="js spaces">&nbsp;&nbsp;&nbsp;&nbsp;</code><code class="js plain">console.log(key + </code><code class="js string">' = '</code> <code class="js plain">+ data[key]);</code></div><div class="line number3 index2 alt2"><code class="js plain">}</code></div></div></td></tr></tbody></table></div></div>-->

        <!--<h4>API methods</h4>-->
        <!--<div class="table">-->
        <!--<table>-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Method</th>-->
        <!--<th>Description</th>-->
        <!--<th>Example</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>(integer)</td>-->
        <!--<td>The slider will change to the specified slide. It starts with 1.</td>-->
        <!--<td>$('#slider').layerSlider(3);</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>next</td>-->
        <!--<td>The slider will change the next slide.</td>-->
        <!--<td>$('#slider').layerSlider('next');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>prev</td>-->
        <!--<td>The slider will change the previous slide.</td>-->
        <!--<td>$('#slider').layerSlider('prev');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>stop</td>-->
        <!--<td>Will stop the slideshow.</td>-->
        <!--<td>$('#slider').layerSlider('stop');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>start</td>-->
        <!--<td>Will continue or start the slideshow.</td>-->
        <!--<td>$('#slider').layerSlider('start');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>data</td>-->
        <!--<td>Returns the slider data object</td>-->
        <!--<td>var data = $('#slider').layerSlider('data');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>userInitData</td>-->
        <!--<td>Returns the object of the slider options which has been set by the user in the init code</td>-->
        <!--<td>var data = $('#slider').layerSlider('userInitData');</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>defaultInitData</td>-->
        <!--<td>Returns the full list of the default slider options</td>-->
        <!--<td>var data = $('#slider').layerSlider('defaultInitData');</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->
        <!--</article>-->
        <!--</section>-->

        <!-- Troubleshooting -->
        <!--<section data-target="troubleshooting">-->

        <!--<nav>-->
        <!--<ul>-->
        <!--<li><a href="#troubleshooting-reporting">Before reporting an issue</a></li>-->
        <!--<li><a href="#troubleshooting-any-issue">Any Issue</a></li>-->
        <!--<li><a href="#troubleshooting-broken">Broken website</a></li>-->
        <!--<li><a href="#troubleshooting-installation">Installation issues</a></li>-->
        <!--<li><a href="#troubleshooting-https">HTTPS (secure) site issues</a></li>-->
        <!--<li><a href="#troubleshooting-general">General issues</a></li>-->
        <!--<li><a href="#troubleshooting-video">Video issues</a></li>-->
        <!--<li><a href="#troubleshooting-jquery">jQuery-related issues</a></li>-->
        <!--<li><a href="#troubleshooting-saving">Saving/Database issues</a></li>-->
        <!--<li><a href="#troubleshooting-other">Other issues</a></li>-->
        <!--</ul>-->
        <!--</nav>-->

        <!--<h1 data-target="troubleshooting-reporting">Before reporting an issue</h1>-->
        <!--<p>There are some common practices you should try before reporting an issue:</p>-->
        <!--<ul>-->
        <!--<li>-->
        <!--<strong>Check System Status</strong><br>-->
        <!--Select <code>LayerSlider -&gt; System Status</code> on your WP-->
        <!--admin sidebar. The page displayed is intended to help you identifying-->
        <!--common issues and to display relevant debug information about your site.-->
        <!--Always try the recommendations provided by this menu (if any) before-->
        <!--reporting an issue.-->
        <!--</li>-->
        <!--<li><strong>Always use the latest software versions!</strong><br>-->
        <!--This includes your WordPress installation, LayerSlider, the WP theme-->
        <!--you're using and any other plugin installed on your site. Third party-->
        <!--plugins and themes (not hosted on wordpress.org) may not update-->
        <!--automatically. Taking care to keep everything up-to-date can spare you-->
        <!--from a lot of problems and frustration.</li>-->
        <!--<li><strong>Try to find the source of the problem!</strong><br>-->
        <!--Issues could be related to other plugins/themes and their settings. We-->
        <!--often ask our customers to temporarily disable other plugins and switch-->
        <!--to one of the default WP themes. This way we can verify that the issue-->
        <!--is related to LayerSlider, and is not an incompatibility with another-->
        <!--item. If it solves the problem, you can find which item caused the-->
        <!--trouble by re-enabling them one-by-one and watching when the issue comes-->
        <!--back.</li>-->
        <!--<li><strong>Try to find a solution!</strong><br> A lot of times-->
        <!--issues occur due to incorrect settings or other environmental factors.-->
        <!--It's always a good idea to quickly review your settings and try to find a-->
        <!--solution in the documentation or online by searching through our <a href="https://support.kreaturamedia.com/faq/4/layerslider-for-wordpress/" target="_blank">FAQs</a>, the <a href="http://codecanyon.net/item/layerslider-responsive-wordpress-slider-plugin-/1362246/comments" target="_blank">comments section</a> and the guides below.</li>-->
        <!--</ul>-->

        <!--<h2 data-target="troubleshooting-any-issue">Any Issue</h2>-->
        <!--<div class="table">-->
        <!--<table class="fr-200">-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>To-Do</th>-->
        <!--<th>Description</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>-->
        <!--Review System Status report-->
        <!--</td>-->
        <!--<td>-->
        <!--Be sure to review the System Status report under the <code>LayerSlider -&gt; System Status</code>-->
        <!--menu on your WP admin sidebar. It is intended to help you identifying-->
        <!--common issues and to display relevant debug information about your site.-->
        <!--Always try the recommendations provided by this menu (if any) before-->
        <!--reporting an issue.-->
        <!--</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<h2 data-target="troubleshooting-broken">Broken website</h2>-->
        <!--<div class="table">-->
        <!--<table class="fr-200">-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Symptom</th>-->
        <!--<th>Description</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>-->
        <!--Unreachable site,<br>-->
        <!--White / blank screen-->
        <!--</td>-->
        <!--<td>-->
        <!--With these symptoms, it's highly likely that there is a PHP-->
        <!--error on your site. Knowing the exact error message can be extremely-->
        <!--useful to understand the nature of the issue occurring on your site.-->
        <!--However, WP ignores PHP error messages by default. Please <a href="https://codex.wordpress.org/Debugging_in_WordPress#WP_DEBUG" target="_blank">follow this guide</a> to enable the WP debug mode to make error messages visible.-->

        <!--<br><br>-->
        <!--Also, make sure that your web server meets the plugin-->
        <!--requirements: PHP 5.3 or newer, PHP Multibyte String Extension,-->
        <!--WordPress 3.5 or newer.-->
        <!--Contact with your web hosting company to make the necessary-->
        <!--changes if it's required.-->
        <!--</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<h2 data-target="troubleshooting-installation">Installation &amp; activation issues</h2>-->
        <!--<div class="table">-->
        <!--<table class="fr-200">-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Symptom</th>-->
        <!--<th>Solution</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>-->
        <!--I cannot install the plugin-->
        <!--</td>-->
        <!--<td>-->
        <!--Please refer to the Troubleshooting section under the <a href="#installation">Installation menu</a>. We've collected common causes and error messages to help you avoiding all the potential issues.-->
        <!--</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>I cannot activate the plugin</td>-->
        <!--<td>Please review our <a href="#activation">Activating the plugin</a> section. Please note, you can't use your theme's purchase code if you've received the plugin that way.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>Canceled activation</td>-->
        <!--<td>Please refer to the <a href="#canceled-activation">Why was my activation canceled?</a> section.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>Updating issues</td>-->
        <!--<td>-->
        <!--Our auto-update solution requires product activation and is-->
        <!--only available for our direct customers as described in the <a href="#updating">Updating the plugin</a> section.-->
        <!--<br><br>-->
        <!--If you receive an <code>Update package not available</code> or-->
        <!--similar error message during the update process it might a symptom of an-->
        <!--interfering 3rd party theme/plugin. We are constantly notifying and-->
        <!--working together with various authors whenever we notice such issue.-->
        <!--Unfortunately, these issues cannot be fixed from our end and a temporary-->
        <!--solution is <a href="#updating-manual">updating manually</a> or temporarily disabling other plugins and switching to the default WP theme.-->
        <!--<br><br>-->
        <!--Another possibility might be a stuck activation. If you've used-->
        <!--our online tools to remotely deactivate a site (or asked us to do the-->
        <!--same on your behalf) your site might no longer be activated. The same-->
        <!--can be true if your purchase code has been revoked due to a refund or-->
        <!--another reason. In cases like this deactivating your site and then-->
        <!--immediately re-activating it can help.-->
        <!--</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<h2 data-target="troubleshooting-https">HTTPS (secure) site issues</h2>-->
        <!--<div class="table">-->
        <!--<table class="fr-200">-->
        <!--<thead>-->
        <!--<tr><th>Symptom</th>-->
        <!--<th>Solution</th>-->
        <!--</tr></thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>-->
        <!--Mixed Content,<br>-->
        <!--Insecure Content<br>-->
        <!--or any HTTPS related issue</td>-->
        <!--<td>-->
        <!--<strong>Quick Fix:</strong> Try the <a href="https://wordpress.org/plugins/ssl-insecure-content-fixer/" target="_blank">SSL Insecure Content Fixer</a> plugin, it should help in most cases.-->
        <!--<br><br>-->

        <!--Any part of your site can be responsible for HTTPS mixed /-->
        <!--insecure content issues. To have a better understanding about what-->
        <!--causing this issue, please read and follow the guide provided by Google-->
        <!--on this matter by <a href="https://developers.google.com/web/fundamentals/security/prevent-mixed-content/fixing-mixed-content?hl=en" target="_blank">clicking here</a>.-->
        <!--<br><br>-->

        <!--Navigate to <code>Settings -&gt; General</code> on your WP admin area and verify that both the <mark>WordPress Address</mark> and <mark>Site Address</mark> fields are containing the right URL with the https protocol included.-->
        <!--<br><br>-->

        <!--Please note, as <a href="https://snippets.webaware.com.au/snippets/wordpress-is_ssl-doesnt-work-behind-some-load-balancers/" target="_blank">this post</a>-->
        <!--mentions, load balancers, proxies, and other network-related solutions-->
        <!--and services may cause WordPress to not recognize the correct protocol.-->
        <!--LayerSlider uses native WP functions to generate URLs, thus in many-->
        <!--cases it is a site/server-related issue that can easily affect other-->
        <!--assets on your site.-->
        <!--</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<h2 data-target="troubleshooting-general">General issues</h2>-->
        <!--<div class="table">-->
        <!--<table class="fr-200">-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Symptom</th>-->
        <!--<th>Solution</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>Instead of the slider only the shortcode appears</td>-->
        <!--<td>Although WordPress parses shortcodes at most places, there-->
        <!--are some exception. Most notably the Text Widget, that will ignore any-->
        <!--shortcode. To fix this you can download 3rd party solutions that will-->
        <!--not ignore your shortcodes.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>An error message says the slider was not found</td>-->
        <!--<td>Please make sure that you've inserted the right shortcode,-->
        <!--and the corresponding slider wasn't removed previously. Remember, the-->
        <!--admin interface can list your removed sliders, but they will not show up-->
        <!--on front-end pages until you restore them.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>The slider doesn't show up at all</td>-->
        <!--<td>This most likely caused by a Javascript error on the page.-->
        <!--Please try to temporarily disable other plugins and switch to one of the-->
        <!--default WP themes to see if it helps.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>The slider only shows a loading indicator</td>-->
        <!--<td>This issue might occur when the slider cannot load some of-->
        <!--the images used in the slider. They might be removed from your WP Media-->
        <!--Library or pointing to incorrect URLs.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>The slider doesn't proceed to the next slide</td>-->
        <!--<td>This is most likely the exact same issue described in the previous point.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>Some images don't show up in the slider or have incorrect size/position</td>-->
        <!--<td>This is usually the symptom of image preloader solutions. It-->
        <!--can be a part of another plugin or a built-in feature in your theme.-->
        <!--Please review your settings, since most authors offer a way to disable-->
        <!--this feature.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>Flashing items when changing slides</td>-->
        <!--<td>This issue usually caused by a duplicate version loaded of-->
        <!--the GreenSock animation library on your site, which may be used by your-->
        <!--theme or another plugin. At the moment there isn't any known method to-->
        <!--avoid issues like this, other than editing the theme/plugin files and-->
        <!--manually prevent loading this library.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>Layers quickly appearing before animating into the slide</td>-->
        <!--<td>See the previous point. It's the same issue.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>The slider doesn't seem to respond changes made on the admin interface</td>-->
        <!--<td>If you're using a caching plugin like W3 Total Cache you-->
        <!--need to manually empty the caches, so you can see the changes in-->
        <!--real-time. These plugins usually offer a setting to disable caches for-->
        <!--logged in admin users.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<h2 data-target="troubleshooting-video">Video issues</h2>-->
        <!--<div class="table">-->
        <!--<table class="fr-200">-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Symptom</th>-->
        <!--<th>Solution</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>Grey preview image</td>-->
        <!--<td>Some videos don't have HD preview images, and you might need-->
        <!--to lower the preview quality in your slider settings if it shows a gray-->
        <!--image with 3 dots.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>No preview image</td>-->
        <!--<td>Vimeo treats Pro/Plus videos as private, even if you make-->
        <!--them publicly available. This causes the preview image not appearing in-->
        <!--the slider making your videos invisible in some cases.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>Videos in the slider have weird size or position</td>-->
        <!--<td>This usually caused by the FitVids Javascript plugin, which-->
        <!--can be a part of other  plugins or the theme you're using. By-->
        <!--temporarily disabling other plugins and switching to another WP theme-->
        <!--you can find which item on your site causes this issue. Please contact-->
        <!--the plugin/theme author to solve this issue.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>HTML5 self-hosted video/audio doesn't work</td>-->
        <!--<td>Please make sure you're using supported media formats by <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Supported_media_formats#Browser_compatibility" target="_blank">clicking here</a>. We recommend using <code>MP3</code> or <code>AAC in MP4</code> for audio, and <code>VP8+Vorbis in WebM</code> or <code>H.264+MP3/AAC in MP4</code> for video. The supported formats may vary between browsers, but you can also provide multiple formats if needed.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<h2 data-target="troubleshooting-jquery">jQuery-related issues</h2>-->
        <!--<div class="table">-->
        <!--<table class="fr-200">-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Symptom</th>-->
        <!--<th>Solution</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>Multiple jQuery issue</td>-->
        <!--<td>Your site includes the jQuery library in multiple times.-->
        <!--This could be an issue with another plugin or the WP theme you're using.-->
        <!--Enabling the <code>Put JS includes to body</code> option in the Troubleshooting &amp; Advanced Settings box should fix this issue.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>Old jQuery issue</td>-->
        <!--<td>LayerSlider requires using an up-to-date version of the-->
        <!--jQuery library. We strongly recommend to have at least version 1.8, but-->
        <!--some of the new features might only work with newer releases.<br><br>If-->
        <!--LayerSlider shows an "Old jQuery issue", it's likely that another plugin-->
        <!--or your WP theme uses an outdated release. Please make sure that every-->
        <!--plugin and your theme is up-to-date and you're using the latest-->
        <!--releases. You can also try to enable the <code>Use Google CDN version of jQuery</code>-->
        <!--option in the Troubleshooting &amp; Advanced Settings box, but it's-->
        <!--possible that you need to contact with plugin/theme author and ask for a-->
        <!--solution if nothing helps.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>jQuery Transit issue</td>-->
        <!--<td>This issue occurred when another plugin/theme loaded a-->
        <!--second copy of the jQuery Transit library. Since LayerSlider v5.0.0,-->
        <!--we're no longer using jQuery Transit, and this issue will not affect-->
        <!--users after upgrading. </td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<h2 data-target="troubleshooting-saving">Saving/Database issues</h2>-->
        <!--<div class="table">-->
        <!--<table class="fr-200">-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Symptom</th>-->
        <!--<th>Solution</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>I cannot save an existing slider</td>-->
        <!--<td>There can be several reasons why this happens. Most likely-->
        <!--it is an incompatibility with another plugin that causes a Javascript-->
        <!--error or some kind of server-side issue. Please try to temporarily-->
        <!--disable other plugins and switch to one of the default WP themes to see-->
        <!--if it helps.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>I cannot add/edit/remove sliders</td>-->
        <!--<td>If you're experiencing multiple issues managing your-->
        <!--sliders, there's probably a database related issue. A common workaround-->
        <!--is to disable LayerSlider and then immediately reactive it. This will-->
        <!--trigger the activations scripts in the plugin that will attempt to-->
        <!--rebuild/repair the DB table that LayerSlider uses. If this doesn't help,-->
        <!--please contact your web hosting provider and check for any database-->
        <!--related problems on your sites such as permissions issues.</td>-->
        <!--</tr>-->
        <!--<tr>-->
        <!--<td>All of my work is just disappeared</td>-->
        <!--<td>This most likely the same issue described in the previous-->
        <!--point. Your work is probably still intact, but a database issue could-->
        <!--prevent the plugin to show them on the admin interface.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--<h2 data-target="troubleshooting-other">Other issues</h2>-->
        <!--<div class="table">-->
        <!--<table class="fr-200">-->
        <!--<thead>-->
        <!--<tr>-->
        <!--<th>Symptom</th>-->
        <!--<th>Solution</th>-->
        <!--</tr>-->
        <!--</thead>-->
        <!--<tbody>-->
        <!--<tr>-->
        <!--<td>The LayerSlider menu item doesn't show up on the admin sidebar</td>-->
        <!--<td>By default LayerSlider is only accessible for admin users. See <a href="#permission-settings">Getting Started / Permission settings</a>-->
        <!--to change this behavior. If you have an admin account it's possible-->
        <!--that these settings have already been changed and the plugin page became-->
        <!--unavailable for you.</td>-->
        <!--</tr>-->
        <!--</tbody>-->
        <!--</table>-->
        <!--</div>-->

        <!--</section>-->

        <!-- Developer documentation -->
        <section data-target="developer-documentation">

            <nav>
                <ul>
                    <li><a href="#developer-warning">It's for developers!</a></li>
                    <li><a href="#developer-documentation">Developer documentation</a></li>
                    <li><a href="#developer-layerslider-api">LayerSlider API</a></li>
                </ul>
            </nav>

            <h1>Developer documentation</h1>
            <h2 data-target="developer-warning">It's for developers!</h2>
            <p>You can skip this part of the documentation if you are not a
                developer. The developer documentation was made for theme authors and
                programmers who want to incorporate LayerSlider in their work or modify
                and extend its capabilities.</p>


            <h2 data-target="developer-documentation">Licensing, Theme Integration, WP Plugin APIs</h2>
            <p>The developer documentation includes licensing terms, theme
                integration guides, plugin APIs, filter and action hooks, and any other
                WordPress related assets you might need.</p>
            <p>
                <a href="https://support.kreaturamedia.com/docs/layersliderwp/developers.html">Open the documentation
                    for developers</a>
            </p>

            <h2 data-target="developer-layerslider-api">Looking for LayerSlider API?</h2>
            <p>The developer documentation focuses on licensing, theme
                integration and WordPress related assets. However, the Javascript-based
                API to control your sliders on the front-end is part of the Advanced
                Customization section. If you are looking for that API documentation,
                click on the link below.</p>
            <p>
                <a href="#layerslider-api">Jump to the LayerSlider API section</a>
            </p>

        </section>


    </div>
</div>

<?php
$js = <<<JS
$(document).ready(function(){
      $("body").addClass("sidebar-collapse");
      $('.sidebar-toggle').remove();

});
JS;

$this->registerJs($js, View::POS_END);

?>

